{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Sen&#39;s Blog",
  "language": "en",
  "home_page_url": "https://blog.senil.me/",
  "feed_url": "https://blog.senil.me/feed.json",
  "description": "Senil&#39;s dumb ramblings.",
  "author": {
    "name": "Senil",
    "url": "https://senil.me"
  },
  "items": [{
      "id": "https://blog.senil.me/splatling-initial-prep/",
      "url": "https://blog.senil.me/splatling-initial-prep/",
      "title": "Splatlings - Initial design",
      "content_html": "<p>Yep! I want to build the splatlings from Splatoon 3 - eventually I want to build the Hydra splatling, but I’ll be starting off with splatlings that focus more on developing specific techniques before moving onto the splatling that will ask the most of me. From learning how to make stuff look metallic, molding materials to form the “metal” canister, fire hydrant, and support bar… the Hydra will take a lot from me.</p>\n<figure><a href=\"https://cdn.wikimg.net/en/splatoonwiki/images/d/d1/S3_Weapon_Main_Hydra_Splatling.png\"><img src=\"https://cdn.wikimg.net/en/splatoonwiki/images/d/d1/S3_Weapon_Main_Hydra_Splatling.png\" alt=\"The Hydra splatling from Splatoon 3\" loading=\"lazy\" style=\"\" /></a><figcaption>The Hydra splatling from Splatoon 3</figcaption></figure>\n<p>There are three splatlings I want to build, each of them focusing on different aspects.</p>\n<h2 id=\"the-ballpoint-splatling\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/splatling-initial-prep/#the-ballpoint-splatling\">The Ballpoint Splatling</a></h2>\n<p>This splatling build will focus primarily on the building aspect. The main hurdle I anticipate is the clear plastic part that makes up like, half of the build. This is going to involve a <em>lot</em> of plexi-molding, 3D printing, and a lot of attention to detail to make what I build look, like, well. A giant ballpoint pen - one of the ones with multiple ink barrels.</p>\n<figure><a href=\"https://cdn.wikimg.net/en/splatoonwiki/images/f/f9/S3_Weapon_Main_Ballpoint_Splatling.png\"><img src=\"https://cdn.wikimg.net/en/splatoonwiki/images/f/f9/S3_Weapon_Main_Ballpoint_Splatling.png\" alt=\"The Ballpoint splatling from Splatoon 3.\" loading=\"lazy\" style=\"\" /></a><figcaption>The Ballpoint splatling from Splatoon 3.</figcaption></figure>\n<p>At some point I want to add a motor, some lights, a speaker, and some other things to really sell that “this is pulled straight from the game” - however, that’s a “later me” problem. I <em>do</em> plan on initially designing with that goal in mind.</p>\n<h2 id=\"the-heavy-splatling\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/splatling-initial-prep/#the-heavy-splatling\">The Heavy Splatling</a></h2>\n<p>This one will focus on the electronic side of everything. Motors, sounds, lights, controls, etc. My biggest concern with the Heavy splatling will be the motor design. My sister’s wife suggested a weak DC motor, and I’ve contemplated setting it up to be belt driven since it <em>might</em> enable me to use similar motor code to drive every other splatling I build.</p>\n<figure><a href=\"https://cdn.wikimg.net/en/splatoonwiki/images/5/5e/S3_Weapon_Main_Heavy_Splatling.png\"><img src=\"https://cdn.wikimg.net/en/splatoonwiki/images/5/5e/S3_Weapon_Main_Heavy_Splatling.png\" alt=\"The Heavy splatling from Splatoon 3.\" loading=\"lazy\" style=\"\" /></a><figcaption>The Heavy splatling from Splatoon 3.</figcaption></figure>\n<p>The Heavy splatling is also going to be 90% about the code, and will be the starting point for the code design I want to achieve. My end goal is a relatively modular code setup that’s segmented in ways that should <em>hopefully</em> minimize the re-writes necessary. Stuff like changing the how long it takes to hit the first and full charge, how long the it fires based on how long it’s charged, all sorts of stuff I want to make as re-usable as possible.</p>\n<p>Both because it’ll make my life easier when it comes to future splatling builds, and also to (hopefully) make it easier for others who want to build a splatling themself.</p>\n<h2 id=\"the-hydra-splatling\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/splatling-initial-prep/#the-hydra-splatling\">The Hydra Splatling</a></h2>\n<p>This one will be the thing to merge everything together. Electronics, building, the works. The build will be the hard part, mostly because the Hydra is my main weapon in Splatoon and I want to put my all into it. Making stuff look like it’s actually metal, figuring out how to build a <em>cast iron fire hydrant</em> without building it from cast iron, the Works. It’ll be a challenge, and definitely one I want to save for last.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/SenilHydra.png\"><img src=\"https://blog.senil.me/assets/images/SenilHydra.png\" alt=\"Senil leaning on the Hydra splatling. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil leaning on the Hydra splatling. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>",
      "date_published": "2024-10-27T00:00:00Z"
    },{
      "id": "https://blog.senil.me/tablets-are-kinda-shit/",
      "url": "https://blog.senil.me/tablets-are-kinda-shit/",
      "title": "Tablets are kind of shit right now.",
      "content_html": "<p>So, uh. What do I mean here? Well, through a couple things I’ve read and watched lately, I’ve formed Feelings and Thoughts regarding the current space of tablets. And in my genuine opinion, they all kind of… suck. Not to say the iPad isn’t great for art, or there isn’t value in a nice Android tablet, or that Windows tablets aren’t (technically) capable of running productivity software. It’s just, well, there aren’t really options that fit what I would <em>personally</em> love to see.</p>\n<p>(update: addenum to the Windows tablet section as of 8:20PM Pacific, 2024-10-26)</p>\n<h2 id=\"android-s-tablet-ui-ux-sucks\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#android-s-tablet-ui-ux-sucks\">Android’s tablet UI/UX sucks.</a></h2>\n<p>OK, so let’s start things off with the Android tablet sphere, because my phone is Android so that’s more what I’m familiar with UI/UX wise. Android tablets are… usually not great. Not necessarily for poor specs, the high-end Samsung Galaxy tabs are <em>really good</em> and try to punch at the same “great for drawing/note taking/art” level that nicer iPads target. It’s just, outside of apps purposely targeted for tablets and tablet productivity, the Android tablet experience is really just “big phone” - which is not good. In part, this is because Android tablets were never really taken seriously outside of “big phone” and general purpose media consumption device, and nobody has really made a “productivity” Android tablet outside of Samsung.</p>\n<p>I don’t count the Pixel tablet because it’s more trying to be an Android tablet that can also act as a Nest Home hub thing whenever you dock it. Which is really neat and I like that idea. It’s just only good at note-taking otherwise, courtesy of USI 2.0 stylus support.</p>\n<p>So, Android tablets are kind of a wash because UI/UX isn’t really meant for that just yet. I’m wrapping ChromeOS up in this section too because it’s the same problem - everything is still primarily geared around the desktop experience, and because a lot of things aren’t designed around Android tablets (let alone ChromeOS tablets) they suffer from the same “big phone” experience - though my basic note-taking app that works on ChromeOS, <a href=\"https://www.squidnotes.com/\">Squid</a>, has a really nice tablet-centric UI on the way. I like it a lot.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\" alt=\"Senil hugging a big pink heart. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil hugging a big pink heart. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"windows-tablets-sadly-aren-t-much-better\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#windows-tablets-sadly-aren-t-much-better\">Windows tablets sadly aren’t much better.</a></h2>\n<p>In part, the Windows tablet experience sucks because ever since Windows 8, Microsoft has really dialed back the touch-centric features of Windows. I totally understand why, since Windows 8 was widely hated because it forced the touch-centric UI/UX onto everybody, regardless of whether you even had a touchscreen available. But it unfortunately means that Windows 11 is <em>terribly suited</em> to a tablet-focused experience as a result.</p>\n<p>I <em>love</em> the overall style of the Surface Pro, and I think the built-in kickstand makes it better suit as a productivity machine as well. Yes, the keyboard setup sucks but I doubt the Magic Keyboard Folio is that much better. Unfortunately, it’s hampered by Windows itself. And extra unfortunately, because the Surface Pro now runs a Snapdragon ARM CPU, it’ll forever be at a disadvantage software wise. I only see that changing if Windows on ARM because a HUGE deal in the coming months and years - and for more ARM chipsets to be powerful enough to provide a solid Windows experience.</p>\n<p>Which is something I doubt will happen because a large install base of Windows machines is desktops, and good luck convincing PC gamers and co. to switch to Linux or find a way to get existing hardware to work via ARM. It’s possible, since the Ampere ARM CPUs (that are meant for servers) do support PCIe 4.0, so technically it’s possible, but we’d need to see consumer desktop-oriented CPUs start to exist first that offer comparable performance to at least last-gen hardware.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\" alt=\"Senil sprawled on his back, sleeping. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil sprawled on his back, sleeping. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h3 id=\"addendum-windows-still-sucks-regardless\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#addendum-windows-still-sucks-regardless\">Addendum - Windows still sucks, regardless.</a></h3>\n<p>I was talking about the state of Windows on ARM last night around when this post went up, and I wanted to wrap some of that into this post, too. The basics is that - despite Microsoft being the one who needs to make “Windows on ARM for productivity” a reality, it means making Windows <strong>something people want to use.</strong> With Microsoft shoe-horning Copilot+, Recall, and who knows what else is in the pipeline, a lot of people don’t trust Windows. I know I don’t - my laptop runs Linux and the only reason my desktop will continue to runs Windows is because <em>my tools don’t work on Linux.</em> It’s not because I LIKE Windows as an OS - it’s <em>okay</em>, but there’s a lot of flaws in it that Microsoft won’t address.</p>\n<p>Because they’re all in on AI, and so a lot of their money - money that could be spent updating Windows and making it something people <em>choose to use</em> - is going towards a fad few people care about when people want their damn operating system to work <em>with</em> them, instead of us having to work with Windows. Windows is a monolith. People use it because it’s what everything has always used, it’s what your new laptop from Best Buy or Walmart comes installed with unless it’s a Chromebook or Macbook.</p>\n<p>I <em>want</em> to see Microsoft push “Windows on ARM is great for productivity!” when it comes to CAD and engineering tools, but people will only care for Windows on ARM specifically if Microsoft can make Windows on ARM worth running. And most people don’t really like Windows at this point. Which fuels the fire <em>against</em> Apple doing anything to make the iPad Pro the true compute powerhouse that it totally could be.</p>\n<p>(anyways, back to the original post)</p>\n<h2 id=\"the-ipad-pro-is-overpowered-for-its-software\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#the-ipad-pro-is-overpowered-for-its-software\">The iPad Pro is overpowered for its software.</a></h2>\n<p>I’m not going to go into the weeds here, because <a href=\"https://www.youtube.com/watch?v=J5wEUpLrQK0\">Dankpods has already done a good video talking about this</a> and <a href=\"https://blog.sebin-nyshkim.net/posts/apple-has-no-idea-what-to-do-with-the-ipad/\">Sebin has as well, though more about how complex the iPad range is now</a>. I really do agree, because iPad OS isn’t great. And a lot of productivity apps that exist on both iPad OS <em>and</em> Mac OS generally gimp the iPad version for some reason or another. From a technical standpoint, there isn’t any <em>practical</em> reason now - the iPad Pro’s run M-series chips (The Pro’s run the iPad exclusive M4, and the Air’s run on their M2), which power their Macbook’s, Mac Mini, Mac Studio, and <em>Mac Pro</em> - though those generally have the higher-end variants, it’s still the desktop-grade silicon.</p>\n<p>Which is what infuriates me the most. I personally will never buy an Apple product unless I can <a href=\"https://asahilinux.org/\">install something like Asahi Linux</a> on it, so it’s not like I’d touch an iPad. But it annoys me that Apple now has iPad’s that could, <em>in theory</em>, run desktop MacOS and run desktop-grade apps, but they’re limited by the garbage that is iPad OS. An iPad Pro that runs a touch-focused version of MacOS would be a <em>massive</em> improvement in my opinion, largely because, well, it’d be a high-end tablet running a desktop OS that’s been designed around ARM since 2020. You could build a strong Windows ARM tablet any day of the week, but Windows on ARM will have to co-exist with x86_64 Windows for a long while - even if Microsoft gets a very efficient system to run x86_64 apps on ARM, most everyone is going to build for x86_64 still.</p>\n<h2 id=\"giving-an-ipad-macos-might-drive-competition\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#giving-an-ipad-macos-might-drive-competition\">Giving an iPad MacOS might drive competition.</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\" alt=\"Senil flexing his biceps, smirking. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil flexing his biceps, smirking. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p><em>(key word being MIGHT)</em></p>\n<p>In my opinion, a large part of why tablets suffer is because they’ve existed in this weird limbo for a while now. Most of the time they’re used as media consumption devices that are more portable than a laptop, but still much larger than a phone. Some tablets get used for at least note taking and some basic document work, higher-end ones are getting used for digital art too - and that’s a relatively recent development. The idea of a true productivity-focused tablet has somewhat existed in Microsoft’s Surface tablet lineup, but x86_64 Windows tablets generally have poor battery life, and Windows on ARM is just now proving to be remotely viable.</p>\n<p>In my perfect world, if Apple gave an iPad Pro a touch flavor of MacOS - still able to run standard MacOS apps and whatnot, just with a more touch-friendly UI/UX - it would pressure companies like Microsoft to push harder for Windows on ARM and bring it up to parity, especially with the needed work to get x86_64 to ARM working smoothly and without fuss. It might get companies like Samsung to push for a better Android tablet experience, or release their own Windows on ARM tablet that trades blows with Microsoft’s - they have plenty of experience with their Galaxy Tab lineup, after all.</p>\n<p>If Apple’s go proves popular enough, it might convince productivity app developers to work on ARM versions that work as well as their x86_64 offerings too, or at least make sure their x86_64 versions run good on a high-end ARM machine. Something that I’d massively appreciate, since so many productivity tools are limited to Windows only, and you have to fight to get them to work on other platforms. If ARM becomes more prevalent on Windows, it’ll hopefully push them to make ARM-focused builds too.</p>\n<h2 id=\"freedom-of-choice\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#freedom-of-choice\">Freedom of choice</a></h2>\n<p>I envision a reality where someone’s operating system of choice isn’t a major barrier in using software. I run a Linux laptop. I want to run AutoCAD Fusion for 3D modeling work. There does not exist an official build of Fusion for Linux, and while hacky methods exist… <em>they’re hacky methods</em>. Where the only limits imposed on how well software runs is the form factor of a device - a desktop with powerful cooling, a hefty power supply, and strong dedicated graphics could run stuff smoother than a powerful but limited laptop, which will run better than a tablet with no air cooling.</p>\n<p>That reality isn’t going to happen, for admittedly good reasons. You don’t really want someone to install heavy 3D modeling software on Nana’s $500 laptop from Best Buy and then complain that it runs like shit, let alone someone’s tablet that’s strong but would overheat in two seconds flat.</p>\n<p>I just wish there was user choice and agency in the matter.</p>\n<h2 id=\"which-is-why-i-want-to-build-dumb-shit\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#which-is-why-i-want-to-build-dumb-shit\">Which is why I want to build dumb shit</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/LaughingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/LaughingSenil.png\" alt=\"Senil laughing on the floor. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil laughing on the floor. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Seriously, part of my motive for my dumb computer-oriented projects I’ll share here - like my stupid “shove a Framework 13 mainboard into a modded Wii U Gamepad” concept - is to see what it takes to build a comfortable compute experience. The Wii U gamepad mod is meant to be silly and make you go “This is a Steam Deck, but it isn’t”. I want to see if I can build bespoke tablets that run on a Framework, too - if I can get a screen with the appropriate eDP port <em>and</em> USB touch (yes, the Framework 13 eDP port looks to support USB 2.0!) then I might be able to build a weird looking but perfectly capable tablet, running full-fledged desktop Linux.</p>\n<p>There’s even a RISC-V board a third party company is developing, though Framework makes it clear it’s for development use only and should not be used as a daily driver mainboard. Perhaps I could run that once it’s fine-tuned, and get the benefits of RISC-V. The sky - and limits of the Framework form factor - is the limit. And I want to discover what’s possible by building this bespoke stuff myself.</p>\n<p>Sure, there’s ARM-based single board computers, but I want to build something that feels “integrated” in a way, and make it as straightforward as possible for <em>someone else</em> to build it, too. Using the Framework board and battery is about the easiest way I could manage that, especially since the mainboard layout isn’t too likely to change for some time.</p>\n<p>Maybe I’ll run into a clever idea one day, and see what it takes to make it into what I “dream” of. It won’t be perfect, but it might get close enough.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\" alt=\"Senil happily tossing confetti in the air. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil happily tossing confetti in the air. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>",
      "date_published": "2024-10-26T00:00:00Z"
    },{
      "id": "https://blog.senil.me/rip-cohost/",
      "url": "https://blog.senil.me/rip-cohost/",
      "title": "Rest in peace, Cohost",
      "content_html": "<p>Cohost is shutting down the end of the year. While I’m kinda sad because it was a good experiment to see if non-federated social media could be viable that doesn’t rely on selling data or anything, I think Anti-Software Software Club just made too many assumptions that didn’t or couldn’t pan out. Including just… not understanding what they wanted in the end.</p>\n<p>This post was originally a three-part tumblr post, so it’s very long. Part “one” was what I think went wrong, part “two” is why I think a federated model “works” a bit better than centralized (though it’s flawed, too), and there’s a “TL;DR” part that <a href=\"https://blog.senil.me/rip-cohost/#the-tl-dr-of-my-thoughts-re-cohost-shutting-down\">I’ll just link to here if you want to skip the many, many paragraphs below.</a></p>\n<h2 id=\"what-i-think-they-assumed\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#what-i-think-they-assumed\">What I think they assumed</a></h2>\n<p>Number 1 mostly being them being “blindsided” by Stripe clarifying their policy that, in the end, means ASSC couldn’t use them as a way for users to tip each other or the Artists Alley section and such. That policy existed for years, well before Cohost ever existed. For context, ASSC originally wanted to build a Patreon competitor, not a social media site. They would have failed so hard if they stuck to a Patreon competitor on this alone.</p>\n<p>And in my opinion, number 2 is their pay. They were paying themselves very well-off all things considered, and everyone was paid the exact same amount (~94k last I heard). That’s… a lot of money going towards pay that could’ve gone to hosting costs. They’re a startup. You pay yourselves what you can. I appreciate that they paid themselves well, but again. Startup. You pay what you can, and they were nowhere close to breaking even at any point.</p>\n<p>I think their financial model didn’t do themselves any favors - they started out with “we got a lot of loan money to do this and now we have to make it profitable” which, yeah, sometimes that’s what it takes. But that’s venture capitalism. Especially since Cohost’s source code WAS the collateral! They acted as a leftist group trying to market themselves as a non-profit/not-for-profit (they’re a LLC, they’re legally not forced to do either), paying themselves well more than they realistically, and hoped they could get enough people to subscribe monthly to break even.</p>\n<p><strong>That… doesn’t work.</strong></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying flat on his stomach. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying flat on his stomach. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Not to say this would’ve fixed things, but I think them registering as an LLC didn’t help. That prevented them from bringing on anything resembling a volunteer, and since their whole thing was “everyone gets paid the same” it meant they had to operate with very few people. If I recall correctly, they had one moderator. Maybe two. Maybe. Two developers, an artist, and a moderator. Four people. MAYBE five, I forget the exact number.</p>\n<h2 id=\"hypothetical-territory-ahead\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#hypothetical-territory-ahead\">Hypothetical territory ahead</a></h2>\n<p>Being a non-profit comes with its own set of problems, but if they could become and maintain a 501©3 non-profit, they could pay themselves what they could and have people willing to help volunteer moderate. They could never get code contributors, though, since their source code was their collateral it by nature had to be closed off. Also, donations (recurring or one-off) are tax-deductible for US-members, so while it’s not a HUGE benefit it offers at least that small bonus.</p>\n<p>I’m glad that they tried, and got as far as they did (even if it meant loan after loan to not die instantly). It showed that it could be possible - that there’s hope in this idea. It’s just a question of HOW to make it a sustainable reality. I don’t think there’s a clear answer there, though. Like my non-profit idea hinges heavily on maintaining 501©3 status (or similar) and being able to bring on volunteers as-needed. Using a public spec for the back-end (like ActivityPub or ATProto) so the focus can be on implementing it (even if federation is never a thing) instead of doing it raw - which avoids the back-end development time but then means having to work with an existing spec that may or may not change substantially over time.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\" alt=\"Senil curled into a fetal position, sobbing. Art by [Dragonjourney](httpss://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil curled into a fetal position, sobbing. Art by <a href=\"httpss://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>I don’t know. I have no idea what would make a medium-form social media such as Cohost viable. Maybe it’s the same idea but with lower pay so it’s easier to bring new people on as-needed, with the expectation that this is a passion project ‘til it gets off the ground. Maybe it takes the “use a public spec for back-end” approach and focuses on the implementation of it with their own additions and flair. ActivityPub is one spec, but you have Mastodon, Pixelfed, Misskey, Wafrn, etc. that all go in different directions. ATProto will likely be the same one day - Bluesky being the obvious “reference” implementation right now, and then various other flavors that go their own direction with ATProto down the line.</p>\n<p>Maybe it’s something else entirely that I could never ever think of. All I do know is that I’m glad they tried. Unfortunately, the writing has been on the wall for months now and honestly? If you didn’t expect that, that’s on you. People have been saying that Cohost wasn’t sustainable for months.</p>\n<h2 id=\"why-i-think-the-federated-model-works-kind-of\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#why-i-think-the-federated-model-works-kind-of\">Why I think the federated model “works” (kind of)</a></h2>\n<p>So part of what makes the fediverse (Mastodon, Pixelfed, Misskey &amp; co., Wafrn, etc. for your Twitter/Instagram/Tumblr vibes) work from a financial view is that costs are spread out across tons of instances, and there are tons of ways to host this stuff. Either from a dirt cheap VPS from Hetzner that hosts a dozen people, to a hundred-ish instance that runs locally with solid redundancy, to a thousand-ish instance that ALSO runs locally (but is suffering growing pains from VPS to local transition IIRC), to a multi-thousand user instance that runs on… something? I don’t know what meow.social uses.</p>\n<p>But those costs are on a per-instance basis, and there are tons of ways to shift that cost perspective around to make things cheaper, or accidentally make things more expensive. Using a more costly VPS service, expensive S3 storage, expensive CDNs to make stuff available more better (extra useful for those huge instances that cross the thousand-member mark), etc. There are various ways to make it expensive.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil screaming in fear, hands on his head. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil screaming in fear, hands on his head. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>But there are ALSO various ways to make the hosting cost go down. Running local boxes means the only hosting cost (outside of external S3 buckets, CDNs, etc.) is the up-front purchase cost of hardware, upgrades over time, and your time-cost of keeping them running (though you might be able to make it set-and-forget enough to where a VPS might be set-and-forget). Forgoing S3 buckets and a CDN mean everything goes through your local boxes, which’ll up local storage needs but again, those are up-front purchases (though you might need to upgrade to small business internet to keep your ISP happy, which I guess counts towards hosting costs but you also live there so…)</p>\n<p>This is, of course, only considering hosting stuff. Pretty much all fediverse instances, as far as I’m aware, run on totally volunteer labor. These instances are passion projects of the admins and mods, run for the sake of running it and to provide community to folks online. If you were to start paying for their time administrating and moderating, then you start to see instance costs go higher and higher (varies on what instances pay folks, how they handle time spent, etc.). That IS a part of the equation that the fediverse does not explicitly handle.</p>\n<p>The same “passion project” logic is a large part of fediverse softward development outside of the big projects like base Mastodon and <em>maybe</em> Pixelfed - those are developed in large part by actual organizations who pay people to do the bulk of the work. But here’s the kicker - other people can also help out. Submitting feature requests, bug fixes, issues, etc. to the teams directly means there’s a chance of problems getting fixed or features added that other developers have the passion to show how to implement it, or discuss how to handle it with the folks who run the project.</p>\n<p>That’s of course something Cohost could never benefit from, because the source code itself was used as collateral for their initial loans. They could never open source it under any terms without the express permission of the loaner, who would likely veto the idea anyways, because there goes the motive to keep it as collateral. They can’t have other people contribute bug fixes or program new features to help them out.</p>\n<h2 id=\"paying-people-to-run-a-service-is-important\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#paying-people-to-run-a-service-is-important\">Paying people to run a service is important</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\" alt=\"Senil pointing towards the viewer, winking. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil pointing towards the viewer, winking. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Cohost does have the benefit of, y’know, paying everyone for their time and energy… but that costs money that I don’t think they considered how to structure. They only ever had one, maybe two moderators for THOUSANDS of users. Yeah, they’re paid, but they literally only have so much time in a day to moderate things - and they can’t be awake 24/7 to watch over things, while volunteer mods might be in various time zones or have different work schedules so there might always be a person or two to monitor stuff.</p>\n<p>I know there’s nothing that can really bridge that monetary gap - paying people and everything around that costs a lot of money, which can scale way faster than hosting costs. The instance I’m on (which shares staff and such with another instance and a Lemmy one so it’s not super fair) has seven people listed as staff. I don’t know how much work they actually put in (or need to put in) to moderating and administrating everything a week, let’s just go with 20 hours a week per person, or 140 hours total per week.</p>\n<p>At my state’s minimum wage (bout $16 an hour right now) that’s around 116.5k annually, or 9710 a month, give or take. I don’t know the exact hosting costs since IIRC stuff is now hosted locally, and I don’t know what additional regular “costs” exist beyond whoever’s basement this is all at, but whatever it was it now requires an extra 9710 a month to break even.</p>\n<p>We have a listed “active user count” of 844 between furry.engineer and pawb.fun - I’m not counting the Lemmy instance because that’s a much harder figure to find. I’m also assuming there are zero duplicate accounts between the instances, and everyone is totally unique. In order to raise enough money just to pay every my state’s minimum wage at 20 hours a week (treating this as a part time job, basically), each member would need to contribute about 11.5 bucks a month to just pay the staff team for their admin and mod work. Probably add in a couple more bucks to help cover any added costs like better internet, increased power bills, etc. and suddenly you might be looking at 15 bucks a month to pay everyone a minimum wage part-time job’s worth of labor and help cover self-hosting fees.</p>\n<p>That’s not a lot of money all things considered - since this is a passion project of sorts I don’t expect this to be a full-time job, especially since nobody is really doing active development work like the Cohost team was doing. But that’s still money to keep it up and running. BUT! There’s a small beauty in all of this.</p>\n<h3 id=\"larger-instances-don-t-necessarily-need-a-ton-more-mods-or-people-behind-it\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#larger-instances-don-t-necessarily-need-a-ton-more-mods-or-people-behind-it\">Larger instances don’t necessarily need a ton more mods or people behind it.</a></h3>\n<p>Take meow.social - a furry instance with about 2.3k active users. I don’t know how exactly they host things, but they have a transparency report that goes over what they raise via Patreon monthly as well as their expenses, and it seems like it trends to around 300 bucks a month for hosting and such. They have two admins and four moderators - taking my same “part time job, my state’s minimum wage” estimate, we’re looking at an additional $8320 a month to pay everyone. Let’s round up that plus the rough hosting cost of 300 to a straightforward $8700 a month. Recall that they have 2300 active users. If every active user donated to meow.social to pay their staff and keep it running, <strong>they’d only need to donate $4 a month on average to keep it going.</strong> Toss in some extra to help build up a small savings for future upgrades and badabing badaboom, you have a functional instance running at not that much all things considered.</p>\n<p>Meow.social is based in France though, so the reality is these numbers are probably low but the point remains that staff plus user count doesn’t have to scale that much, but you should still have plenty of mods to be effective.</p>\n<p>However, meow.social is still a passion project - everyone part of running it has real jobs outside of it, the paying part is just a “thank you” of sorts to help cover their time and reward their efforts. And that’s kinda the bridge between fediverse projects, which are generally run as a passion project and any donations/payments are a “thanks for keeping this going” deal. While a brand-new social media, which has the development costs of building the damn thing on top of hosting and paying people, is GOING to cost more money because you have to pay for the development work too, which is definitely a full-time job that’ll have to pay decent enough to entice people to work there and stick around.</p>\n<p>It’s why I mildly get the Cohost team paying themselves well - it’s not exactly easy work doing all of this. And it’s not like I know their exact numbers on hosting costs, development time, legal fees, etc. that factor into everything. But I still think that maybe there was something that they could’ve done differently to stay on top of things better, and maybe. Just maybe. Pull off the ultimate mission of “making centralized social media that doesn’t suck for users.” That’s why I applaud the Cohost team for trying, and succeeding (ish) for so long.</p>\n<p><strong>They suggested that this might actually be possible, if things worked a little differently.</strong></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\" alt=\"Senil happily tossing confetti in the air. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil happily tossing confetti in the air. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"the-potential-of-cohost\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#the-potential-of-cohost\">The potential of Cohost</a></h2>\n<p>Put more effort into the core product and fixate on one idea instead of trying to come up with a different one, leaving the core product untouched for months. Maybe use existing back-ends to kick-start development, so that you aren’t building entirely from the ground up and have reference implementations of various things to help get the project going (aka my idea of using ActivityPub or ATProto as the back-end, with the intent of never allowing federation). Paying yourselves a bit less to compensate for “this is a start-up effort” and prioritize having more of the support crew as-needed.</p>\n<p>I know that there’s potential here. I don’t know how to go about it, or if it’s even worth the initial investment to try, but I at least think that it might maybe be viable. It’ll take some clever thinking, but ultimately Cohost was a starting point in the effort to return to a less-scummy web. They started the path to proving it’s possible, even if in the end they failed. Hopefully some other crew picks up the torch and goes farther, having learned from what likely did Cohost in and doing better.</p>\n<p>Ultimately, there’s just no way to possibly know. All I want is for folks to have more spaces online that aren’t data-selling hellholes like Facebook/Instagram/Threads, Twitter, Tumblr, probably Bluesky eventually (if not already), Reddit, TikTok, etc. There aren’t many well-known medium to large online spaces that are run by the people, for the people anymore. It’s all about “line go up” forever to please shareholders and venture capitalists, not breaking even while running a satisfying service.</p>\n<p>While I think the fediverse proves a different direction that social media could take, being a source of passion projects and the occasional corporate group paying folks to develop key pieces that help everyone else, there is still a place for more centralized social media. The fediverse has its own problems too, both structurally and socially.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil screaming in fear, hands on his head. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil screaming in fear, hands on his head. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h1 id=\"the-tl-dr-of-my-thoughts-re-cohost-shutting-down\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#the-tl-dr-of-my-thoughts-re-cohost-shutting-down\">The TL;DR of my thoughts re: Cohost shutting down.</a></h1>\n<p>OK this is still a long TL;DR but I tried OK?</p>\n<ul>\n<li>Cohost is shutting down end of the year, going read-only October 1st and getting data backups out the door ASAP. In my opinion, this was going to happen eventually given their funding model - so it was a question of “when”, not “if” it happens.</li>\n<li>Despite the flaws I saw in how Anti-Software Software Club marketed themselves as a company (being leftist co-op not-for-profit despite being an LLC with no obligation to do that), there was still value in what Cohost was trying to do.</li>\n<li>Them incorporating as an LLC, to myself, might have been a mistake since it legally prevented them from bringing on anything resembling volunteer moderators. While being a 501©3 or similar non-profit is difficult, they could still pay the core team and have volunteer mods if needed.</li>\n<li>Their initial round of funding used the Cohost source code as collateral, preventing them from making it open-source to help gather community contributions to bug fixing, feature requests, etc. on the back-end directly.</li>\n<li>They wildly misunderstood Stripe’s terms of service when it comes to payments, forcing them to gut months of work into “eggbux” which is basically what tumblr tipping is, and was part of their effort to become a Patreon alternative (their original goal). They claim this was a sudden change, despite it just being a language clarification for a policy Stripe has had for years now.</li>\n<li>Per the leftist co-op branding, they all agreed to pay themselves equally (for the most part, stuff has changed now and then) and increase their pay to align with cost-of-living adjustments. This, to me, is a noble goal, but contributed to the vast majority of their expenses and made it even harder for their user base to subscribe and help cover operating costs.</li>\n</ul>\n<h3 id=\"despite-all-of-these-negatives-they-still-managed-to\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#despite-all-of-these-negatives-they-still-managed-to\">Despite all of these negatives, they still managed to…</a></h3>\n<ul>\n<li>Prove that this is a viable concept - Cohost has INCREDIBLE subscriber rates for people who are willing to pay for the service to keep it alive. This, to me, heavily suggests that people want not-scummy social media that doesn’t sell user data or push shitty ads.</li>\n<li>Prove that users like this kind of service. As far as I’m aware, there was no advertising for Cohost outside of word-of-mouth. Everyone who signed up likely heard of it from someone else. This of course weakened new user rates, but it also meant every active user there heard of it from someone and liked it enough to stay.</li>\n<li>Prove that it might just be possible to do all of this work and pay their core team. That idea alone likely led to more monthly subscribers willing to help keep it afloat, because they knew their money was also helping keep them paid too. I still disagree with their payment model and motives, but hey. They still did it.</li>\n</ul>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\" alt=\"Senil flexing his biceps, smirking. Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil flexing his biceps, smirking. Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p><strong>Cohost, despite its flaws, was a fantastic experiment.</strong></p>\n<p>I’m sad that it’s gone, but happy for what it was able to achieve and suggest is possible for future projects. I don’t want people to be disheartened by Cohost’s attempt - I want people to see what they did, try to understand the core pain-points, and try to get farther than ASSC did with Cohost. Maybe we’ll have a true, not-scummy centralized social media competitor someday, because people dare to keep trying to make the dream real.</p>\n<p>Will that ever happen? Time will tell. But I don’t want folks to ever give up. The web can still be ours, one made for the people, by the people, instead of for venture capitalists who want more money forever and ever.</p>\n",
      "date_published": "2024-10-25T00:00:00Z"
    },{
      "id": "https://blog.senil.me/critical-infra-and-e2ee/",
      "url": "https://blog.senil.me/critical-infra-and-e2ee/",
      "title": "Why I view E2EE the same as critical infrastructure.",
      "content_html": "<p>This is just a compilation of a very long thread I made on Mastodon so I can share this better. For more context, this is all in reference to my replies to Soatok’s ongoing responses to the Matrix dev team re: Soatok’s responsible disclosure of security flaws. The TL;DR is Matrix was using an educational implementation of a thing, that explicitly said to not use it in production, and didn’t do anything about that for seven years until Soatok found it.</p>\n<p><a href=\"https://furry.engineer/@senil888/112964632462775370\">Here’s a link to my first of the reply chain directly talking about that.</a></p>\n<h2 id=\"i-kind-of-worked-in-the-power-industry\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#i-kind-of-worked-in-the-power-industry\">I (kind of) worked in the power industry.</a></h2>\n<p>The main project I had with my (now former) company in my short time there was for a hydro dam up in the Idaho panhandle, in Boundary County - not joking, it’s called that. That’s not too important, though.</p>\n<p>What is important is that this fairly small hydro dam, which can output about 4 megawatts during peak spring runoff, helps power the nearby towns via a city-run utility. While it’s not the end of the world for the dam to be offline, them being offline means the utility has to buy even more power than if it was running. Which costs the city a fair bit more money than running the dam themselves, because you have the power generation places that need their money to run their facilities, the transmission companies that need to fund their projects, and on and on and on.</p>\n<p>So, it’s pretty important to help them get back on their feet. And we had a big task - we were to replace their old Allen-Bradley PLCs with our own, and toss in a SCADA system too.</p>\n<p>The SCADA system is fairly straightforward when it comes to data inputs - I could just take the data, label it, maybe do some conversions as-needed, and toss it up the chain. For this system, it went from generator-connected programmable logic controller (PLC) to a beefier controller running more sophisticated software, as well as a basic HMI, up to a control house computer that ran a COPA-DATA Zenon HMI that we also designed and developed. <strong>We were responsible for a lot of stuff.</strong></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"the-controls\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#the-controls\">The Controls</a></h2>\n<p>The hard part comes in when we actually add in the controls. Which is, y’know, important since we’re replacing everything their old PLCs did with our own system and solution. Which meant we needed reference code, since the customer knows their system the best (mostly, we talked with the operators who knew how to run the thing, but didn’t 100% know the backbones). What we got? Was in ladder logic. Which looks very different to structured text, which is probably what you think of when I say “what does a programming language look like typed out?” So… not only did we need to re-create that, we had to “translate” it into ST as well. Fun!</p>\n<p>This is where the controls joy comes in. Each PLC acts mostly the same when it comes to general operations. These outputs are for lights, this output needs to do this thing and get this signal for some time back before another thing can even think about asserting, etc.</p>\n<p>Spinning up a hydro generator takes a decent bit of time. Not forever mind you, but there’s a lot of steps involved. First you need to get water to, well, the generator’s turbine inlet. But you can’t just send water straight from the turbine inlet valve (TIV) to the turbines. You need to balance the water pressures between everything because if you don’t? Congratulations, you just broke the turbine and this generator has to be rebuilt.</p>\n<p>Once the TIV bypass does its thing for a while, we can actually open the TIV and start to send water to the turbine. Once water is getting to the turbine, we open up the wicket gates - which actually finally let water to the turbines. They’re controllable, so we can define exactly how much water gets to flow, and thus how much power a generator actually outputs.</p>\n<p>Then it’s the usual generator stuff. Get the thing up to speed and, once it’s up to speed and stays there for a little while, ya gotta sync the generator phases and frequency to the grid phases and frequency. If the phase angles are off too much, you end up kicking the generator forwards or backwards when the breaker closes to the grid. That can be violent, and harm the generator over time - or outright break it if the phase angle is off by too much. So we need that to be as precise as possible, and to close as soon as we’re confident it’ll safely kick in without breaking anything. So that’s the gist of the start-up sequence at the dam. All is well and good there.</p>\n<h2 id=\"edge-cases-cannot-exist\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#edge-cases-cannot-exist\">“Edge cases cannot exist.”</a></h2>\n<p>However. There’s a fail over system with the Zenon HMI. See, the two powerhouse controllers gather all available data in this system as a form of redundancy - not via the physical network, but via the hardware. This is fine when it comes to inputs, since that version of Zenon can only listen to one controller at a time, but we run into problems with outputs. The “Zenon only talks to one controller at a time” becomes the enemy, in a way.</p>\n<p>While realistically rare, or outright “would never happen”, it is still technically possible for an operator to send a binary output command or update an analog setting <em>while Zenon changes which controller it listens to</em>. This can be for a variety of reasons - the operator told the controllers to switch over, Zenon lost access to one controller so it’s starting to talk to the other (a process that takes a bit of time), etc. <strong>The absolute last thing we need is for a command to be sent twice during this switchover,</strong> because output data cannot be shared between the two because of the whole “Zenon can only talke to one controller at a time.”</p>\n<p>Our first main problem was fixing this control switchover problem, brought upon the very nature of our design scheme and how Zenon works (which I think they’ve fixed since that version, but I never worked on Zenon myself). Again, we have to account for every possible problem which means figuring out how to make sure a command sent from Zenon “syncs” between devices. The solution I came up with was pretty clunky, to be frank, but it worked - I literally just told the controller that knew it was talking to Zenon to periodically pulse the analog setpoint to the other controller, so it at least knew what was going on and could report back to Zenon appropriately.</p>\n<p>What ended up happening was one generator - which was being rebuilt - wouldn’t report how far the wicket gates were open. I shouldn’t need to say that “this is bad” because if we can’t tell how far the wickets are open, <strong>we have no idea how much water, if any, is getting to the turbine proper.</strong></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>The sensor was a hall effect one, made of steel. There is a window above it. This is a dam, close to the river and a waterfall. I hope you can guess what the problem is. Hint, it involves steel not liking moisture. We cleaned out a COPIOUS amount of rust, and hey look the sensor was finally working again, we got wicket gate data. So we could finally spin up this generator. Which we were able to do…</p>\n<p>Except, y’know. Problem time. The generator was vibrating, and vibrating a LOT. Consistently. Every time it started up, some code I adapted from the original ladder logic would run and trigger an emergency stop. The code runs on the controller directly talking to the generator, quietly monitoring vibration data. If ANY of the four input sensors report values over some threshold for more than a few seconds? Emergency stop time.</p>\n<p>So something is still wrong with this generator. We trust the sensors since we’re getting good data as the generator spins up, it just… shakes too much. We actually temporarily disabled the logic that trips the generator to monitor its behavior if it didn’t e-stop in time. It kept vibrating, more and more. It would probably shake itself apart if you let it keep going. It also did it consistently, and it was one bearing’s sensor that was consistently tripping. <em>(aside: that bearing had also seized up TWICE during prior trips to commission this generator. It also did it again after we left the site. That bearing did not like existing, apparently.)</em></p>\n<p>The only reason we were able to check this case is because what I had written worked and we knew it worked. In part because that same logic was on three other generators, but we were able to accidentally prove that hey, if this happens, it’ll trigger an emergency stop no problem. It turned out the people rebuilding the generator didn’t balance the flywheel when they fixed the bearing before, so oops! You can’t spin that thing up just yet.</p>\n<h2 id=\"remember-lives-are-at-stake\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#remember-lives-are-at-stake\">Remember: Lives are at stake.</a></h2>\n<p>Imagine how bad this whole thing could’ve been if we weren’t as rigorous as we were. Generators could’ve broken apart. People could’ve been hurt. Expensive equipment could’ve gotten seriously damaged. Hell, it might not even have started up because of how much other equipment we had to interface with that we couldn’t investigate ourselves. That client trusted us to get their dam up and running with new hardware that would treat them well for many years to come, and to build a partnership with a firm they could trust. In the end, we delivered and they’re supposedly working on more (smaller) projects with them.</p>\n<p>I don’t know the specifics, but BECAUSE we were persistent in making sure every edge case we could think of was resolved, and fixing everything in real-time as problems came up (and making sure our fixes wouldn’t introduce NEW problems) we were able to tell them “you can trust us.” Because ultimately, <strong>“no one is obligated to buy from you. You can go out of business tomorrow if everyone decides to never work with you.”</strong></p>\n<p><em>(aside again: this is something I try to tell anyone who is running any kind of small business. Nobody is obliged to commission you, to hire you, to whatever. It’s on you to stay on top of things and make people want to work with you, and keep working with you.)</em></p>\n<h2 id=\"this-is-still-about-matrix-trust-me\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#this-is-still-about-matrix-trust-me\">This is still about Matrix, trust me.</a></h2>\n<p>It’s largely because of my experience with the hydro project that I just can’t trust companies, projects, and teams that hide vulnerabilities and failure points and hope nobody finds them. It makes me question how many they actually have hidden when someone does find one. How many defects does their thing have, if some of the most obvious ones are let through? If this obvious error got through their QA checks, what else is lying under the hood that we don’t know about yet?</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Art by [Dragonjourney](https://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Art by <a href=\"https://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p><strong>Can I trust this system to be robust enough in the event of a catastrophic failure?</strong></p>\n<p>I know cryptography - E2EE in particular - isn’t remotely comparable to what I’ve worked on, but what I’ve worked on is super important. Lives are at stake with these projects. I need to be confident that what I do isn’t going to hurt people. That it isn’t going to break equipment. That it isn’t going to fail in two years because of an oversight, <em>or something we knew about and ignored because it’s “technically impossible”.</em></p>\n<p>I need projects in critical fields that take themselves seriously to ACT like lives are at stake, because maybe some are.</p>\n<p>But if you’re taking yourself seriously, in something as important as cryptography, something that is increasingly important every single day in every field - critical infrastructure included - you need to act like lives are at stake if you fuck up.</p>\n<p>I know some of this shit is just a chat protocol, “why are you so pressed” blah blah blah. A lot of people herald E2EE services as a secure way to also talk about protests and labor organization without significant risk of getting caught. Of course, if you don’t regularly use E2EE normally the fact you use it might implicate you. When it comes to organizing? If a court requests data from some service, as little data as possible should be sent out. Because people get jailed or imprisoned for organizing. Those lives are on the line if your system isn’t up to snuff.</p>\n<p>This isn’t to say “just pick any E2EE service, it’s fine” because it’s not fine to do that. People need a service they can trust, that’s reliable, that takes security seriously and does everything in their power to make sure what they do is as secure as possible. From what they know is a fail point, and what they later find out is a new possible fail point. People need services they can trust that has their best interests in mind. Clients need businesses they can trust that can hold up their end of the contract and deliver a quality solution that fits their client’s needs.</p>\n<p><strong>Why should anything like this be any different?</strong></p>\n<p>People die when we fuck up in the power industry. We can’t allow that to happen, ever. Our trust is built upon proving a track record of quality work that is done timely. Work that stands the test of time as systems operate. I know a lot of shit is nothing compared to critical infrastructure, but I wish more folks took it remotely as seriously as people in my industry have to. Because if we fuck up, people get hurt. People lose power. Facilities get damaged. Industry stops. And, ultimately…</p>\n<p><em><strong>If the power goes out… so does everything else.</strong></em></p>\n",
      "date_published": "2024-10-21T00:00:00Z"
    }
  ]
}
