{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Senil&#39;s Blog",
  "language": "en",
  "home_page_url": "https://blog.senil.me/",
  "feed_url": "https://blog.senil.me/feed.json",
  "description": "Senil&#39;s dumb ramblings.",
  "author": {
    "name": "Senil",
    "url": "https://senil.me"
  },
  "items": [{
      "id": "https://blog.senil.me/state-of-amtrak/",
      "url": "https://blog.senil.me/state-of-amtrak/",
      "title": "The State of Train Travel in the United States",
      "content_html": "<p>I, somewhat recently (okay, back in July) took the train from where I grew up to where I live now, after visiting family for the 4th of July. A day that should not be celebrated, but I digress. When I say “the train” I mean THE train, as there is exactly one that covers the trip between the two locations.</p>\n<p>Ultimately, this is about that situation. I don’t want to dive into how long train travel is, why high speed rail is a necessity here, or any other matters regarding Amtrak’s funding and how its treated as a private business that happens to receive government funding instead of as a proper public service to the people. I could go on for pages if I dove down that topic, which I may or may not talk about in the future. Let’s be real, it’ll probably happen one day, when I take yet another train trip south towards Los Angeles or say “fuck it” and go out east towards Chicago.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>But for now… let’s talk about routes and timetables.</p>\n<h2 id=\"amtrak-routes\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/state-of-amtrak/#amtrak-routes\">Amtrak Routes</a></h2>\n<p>This is primarily about regions farther west from the many cities east of the Mississippi river. Because those areas have far better rail coverage than most regions west of the Mississippi, they’re generally well served. Not <em>perfectly</em> served, mind you, as there’s still a plethora of cities and regions that lack any train service, but it’s nowhere near as bad there as over here.</p>\n<p>There are exactly four routes that link the West Coast to the rest of the United States - three of which share one end point in Chicago, Illinois. There’s <a href=\"https://www.amtrak.com/routes/empire-builder-train.html\">the Empire Builder</a> that runs from Chicago to Seattle and Portland, going through Minnesota, North Dakota, and Glacier National Park, before splitting in two in Spokane, Washington. There’s <a href=\"https://www.amtrak.com/routes/california-zephyr-train.html\">the California Zephyr</a> which runs between Chicago and San Francisco, routing through southern Iowa and Nebraska, northern Colorado, central Utah, and the northernmost part of Nevada. There’s also <a href=\"https://www.amtrak.com/routes/southwest-chief-train.html\">the Southwest Chief</a>, connecting Chicago and Los Angeles via north Missouri, central Kansas, New Mexico, and the northern part of Arizona before carefully avoiding Las Vegas. And we simply can’t forget <a href=\"https://www.amtrak.com/routes/sunset-limited-train.html\">the Sunset Limited</a>, the only long-haul east-west route that <em>doesn’t</em> end in Chicago - instead it connects New Orleans to Los Angeles, traveling fairly close to the southern border the whole way.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>That’s it. Those are your four major east/west lines. Hope you like starting or ending in Chicago.</p>\n<p>The west coast does have a few north/south routes connecting the states. The major route route west of the Rocky Mountains is <a href=\"https://www.amtrak.com/routes/coast-starlight-train.html\">the Coast Starlight</a>, connecting Seattle down to Los Angeles with stops in Tacoma, Washington; Portland, Oregon; Sacramento, California; and several other major cities along the way. The <em>only other</em> north-south connection that covers the entire nation west of the Mississippi river is <a href=\"https://www.amtrak.com/routes/texas-eagle-train.html\">the Texas Eagle</a>, which if you guessed that it starts in Chicago you’d be correct - because it connects Chicago to San Antonio, Texas, with extra stops in St. Louis, Missouri; Little Rock, Arkansas; Dallas, Texas (and Forth Worth); and Austin, Texas. Do you live in Denver, Colorado? If you want to take the train north or south, you have to go extremely out of your way just to get to a different city - effectively forcing you to either take a random bus, drive yourself, or deal with airports and flying places.</p>\n<p>There’s also several shorter, more “business” oriented routes that focus on connecting specific regions instead of the entire coastline. The one I might take one day is <a href=\"https://www.amtrak.com/routes/cascades-train.html\">the Amtrak Cascades</a>, which routes from all the way up in Vancouver, British Columbia down to Eugene, Oregon - stopping in Seattle, WA; Tacoma, WA; Portland, OR; and Salem, OR. There’s three shorter haul routes in California that connect North/Central California and Southern California together. North/Central California is in part covered by <a href=\"https://www.amtrak.com/routes/capitol-corridor-train.html\">the Capitol Corridor</a>, linking Auburn, CA to San Jose, CA; making sure to cover Sacramento, San Francisco, and Oakland along the way. <a href=\"https://www.amtrak.com/routes/san-joaquins-train.html\">The San Joaquins</a> links the Bay Area to Southern California - starting in San Francisco and Sacramento (another one of these “split in two” trains, I think) before linking back up in Stockton, CA and traveling south towards Fresno, CA and ending in Bakersfield, CA - an area also known as the Inland Empire. Finally, connecting the southernmost part of California is <a href=\"https://www.amtrak.com/routes/pacific-surfliner-train.html\">the Pacific Surfliner</a>, running from San Luis, CA down to San Diego, CA via Santa Barbara and Los Angeles - and Anaheim too, if you want to go to Disneyland.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\" alt=\"Senil sprawled on his back, sleeping. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil sprawled on his back, sleeping. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>So, in total, we have one major north/south route in the Coast Starlight; one route that covers the west side of Washington and Oregon; and three covering <em>parts</em> of California - the northernmost parts of California are solely reliant on the Coast Starlight themselves, as is the southernmost part of Oregon. Do you live around the Rocky Mountains? Fuck you, you can’t easily go north to south. Do you live in Boise, Idaho? No train for you, period - Amtrak doesn’t provide any service there.</p>\n<p>This is, in my opinion (and from what I see, many others) as a serious disgrace. There is so little rail connecting our gigantic nation, and especially those of us who have the “disgrace” of living west of the Mississippi river. There’s a reason many folks deal with the mess that is air travel - it’s simply the <em>only option</em> many have to go from Point A to Point B, even if both are major metropolitan areas.</p>\n<h2 id=\"amtrak-timetables\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/state-of-amtrak/#amtrak-timetables\">Amtrak Timetables</a></h2>\n<p>While this problem is, in my opinion, less of an issue than the fact that there just aren’t routes linking our nation, it still plays into the reality that makes folks rely more on driving long distance or flying in planes. And that’s how frustrating the timetables are between major stops.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>The stop that the Empire Builder splits in two or merges together at (depending on whether you’re going to or from Chicago), has arrivals and depatures around 1 AM or 3 AM. Want to take the train to or from Spokane, Washington? Fuck you, you have to deal with these ridiculously late (or ridiculously early) times. The same applies to if you’re arriving in Fargo, North Dakota whether you’re going east or west, or getting off at St. Paul-Minneapolis after departing from Chicago. I imagine it’s a very, VERY similar story to the California Zephyr, Southwest Chief, and Sunset Limited for our east/west routes, and the Coast Starlight as the lone north/south long-haul connection.</p>\n<p>There isn’t a whole lot that can be done about this, unfortunately. While it’d be lovely for Amtrak to run more trains along these extremely long-haul routes, it simply only makes sense if there’s the ridership to warrant it. Something that just won’t happen unless air travel becomes so inconvenient that trains are routinely filled to the brim - or at least close to capacity between its various stops. Even though I think rail travel should be treated as a public service rather than a weird government private business, all of this travel would require significantly more stock than Amtrak currently handles, and would increase maintenance costs as a result. Again, this is a cost the government should burden, but that just ain’t true as of today.</p>\n<p>This is a problem that high-speed rail could somewhat alleviate, but there would still be awkward timetables for various cities, and high-speed rail can’t cover every single smaller town or region that could benefit from rail access in the first place. You also run into needing to build high-speed rail across Native land, and potentially having no choice but to cut through a reservation due to terrain difficulties along other potential stretches. Even if you did manage to avoid high-speed rail cutting through at least the reservations, you would still leave plenty of cities that could benefit from rail out from the improved faster routes because it’s difficult to financially justify serving them due to location - requiring more smaller routes to operate to try and link them to more centralized high-speed hubs.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying face-down on the ground, with a low battery symbol above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying face-down on the ground, with a low battery symbol above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"the-hell-can-we-do\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/state-of-amtrak/#the-hell-can-we-do\">The hell can we do?</a></h2>\n<p>God, I wish I had an answer here. I don’t think there’s anything that <em>can</em> be done, because it relies on getting the federal government to properly fund any public service in the first place, before acknowledging Amtrak’s existence and re-prioritizing rail as a necessity for our nation. Which, given the direction the United States has been on for decades now, simply won’t happen without some drastic changes to the entire government in all aspects.</p>\n<p>Hell, they want to fucking defund the United States Postal Service and turn it into a private enterprise - while the USPS is not <em>legally</em> required to exist (though it is certainly interpreted as such courtesy of <a href=\"https://constitution.congress.gov/browse/article-1/section-8/clause-7/\">Article I, Section 8, Clause 7 of the Constitution</a>), so long that it does exist it must serve every citizen of the United States - even the most rural, out of the way locations must get service. Service that commercial providers probably don’t bother with, because those rural areas cover so much land for so few people. There just ain’t no way they’d spend the hundreds of millions of dollars to merely update the Amtrak fleet to modern stock, let alone the hundreds of millions to connect the nation together with new low-speed routes… and that’s before we get into needing to re-develop the massive rail network to somehow accommodate high-speed tracks, which functionally require separate rail with a different gauge that can handle stock traveling at speeds well in excess of a hundred miles per hour.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\" alt=\"Senil curled into a ball, crying. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil curled into a ball, crying. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>So… unfortunately… we’re stuck with the system as it is today. Maybe one day we’ll get proper national rail coverage that benefits us all, instead of the few areas that happen to have good access and routes available.</p>\n<p>A day I can only dream of… and fight to make happen.</p>\n",
      "date_published": "2025-10-31T00:00:00Z"
    },{
      "id": "https://blog.senil.me/public-health-at-large-cons/",
      "url": "https://blog.senil.me/public-health-at-large-cons/",
      "title": "Just Say No to Con Crud.",
      "content_html": "<p>This was originally going to be part of <a href=\"https://blog.senil.me/megacon-musings\">my other megacon post</a>, but it spiraled into its own thing WAY too fast, and detracted from the original point I was trying to make there. So, it’s its own post now. These complaints and frustrations are by no means exclusive to furcons - any convention, especially large ones, are just as big of a concern here - but furcons are what I hear the most about because, well, I’m a furry. Who follows other furries on Bluesky and the Fediverse. And talks to other furries on those platforms and on Telegram and Discord and Signal.</p>\n<p>So don’t come at me with “well this isn’t a problem at (insert convention here)!” or whatever. This isn’t about specific conventions, this is about a general trend I - and many others - have noticed.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"superspreader-events-at-conventions\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/public-health-at-large-cons/#superspreader-events-at-conventions\">Superspreader events at conventions</a></h2>\n<p>Now that we’re “through” the pandemic that is COVID-19 (we aren’t, but I digress), a lot of folks have gotten lax about public health measures to keep themselves - and others - safe. Even stuff as basic as not going to a con at all when you’re sick, which includes physically going to the venue somehow, not just going to the con floor, seems like it’s being forgotten. Folks aren’t masking up when they’re sick in general. And when you shove a bunch of people into one collective space who don’t take the easiest of precatuions, you’re primed to have something nasty break out because of one event.</p>\n<p>Con crud is, to some extent, normal. People get colds, maybe their stomachs feel off for a few days after, that all is <em>mildly</em> expected. Colds are common though never pleasant, and at a convention you’re likely not eating the same diet as normal, so your gut microbiome is fucked up and complaining like crazy. Personally, I consider those general symptoms - some mild sniffles and a weird gut - as expected. Though of course, they’re largely preventable with some effort and planning, but you can never guarantee it’ll not happen to you. The reality where you’ll never get seriously ill from a convention is simply a fairy tale.</p>\n<p><sub>(I have no idea why people think they’re above getting sick.)</sub></p>\n<p>It could be norovirus, a nasty stomach bug that can fuck people up for days on end.</p>\n<p>It could be influenza, which has had strains that are particularly nasty with vaccines doing their best to keep them under control. Or perhaps the current round of avian flu, which is even nastier than the influenze we deal with year-round and - as far as I’m aware - is not currently guarded by vaccines beyond “it’s close enough to the influenza strains we normally target.” <a href=\"https://blog.senil.me/public-health-at-large-cons/\">It’s particularly fatal as well</a>, so it’s even more important to take it seriously.</p>\n<p>Hell, it can be COVID-19. Do y’all remember how public health officials like the WHO and CDC were listing a gigantic range of symptoms, from respiratory to stomach, cardiovascular to neurological? That’s because the virus that causes COVID-19, at least back then, attached to a receptor that our bodies use fucking everywhere. And while we have vaccines now, the vaccine <em>does not</em> make you immune, contrary to what I imagine some of y’all thought up until this very moment. There are very, VERY few vaccines in general that make someone completely immune to a disease. All that the COVID-19 vaccines promise is to reduce the severity.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"I know this gets hammered home but I swear some people keep forgetting not every vaccine immunizes. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>I know this gets hammered home but I swear some people keep forgetting not every vaccine immunizes. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"please-take-precautions\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/public-health-at-large-cons/#please-take-precautions\">Please take precautions</a></h2>\n<p>A lot of people would love to go to a convention, even one as “small” as Anthro New England or Furlandia, to meet up with a ton of folks. But many people don’t take the appropriate precautions. People aren’t doing what they can to help protect those who want to go, but can’t out of their own safety - doesn’t matter what illness they’re particularly afraid of, or if any illness will fuck them up. I cannot speak on the situation of others, but I can speak for myself, because I’m outright terrified of getting COVID-19 ever again.</p>\n<h3 id=\"my-time-with-miss-rona-aka-covid-19\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/public-health-at-large-cons/#my-time-with-miss-rona-aka-covid-19\">My time with Miss Rona, aka COVID-19</a></h3>\n<p>Because I’ve already had it twice. And the first time probably fucked me up for life, by messing with my brain enough to where I probably have a seizure disorder now. A week after I first displayed symptoms back in May of 2023, I had my first ever pair of seizures. The first one led to a dislocated left shoulder, alongside a broken bone by the shoulder. The second in the pair dislocated my right shoulder. And while I don’t have solid evidence that my second ever pair of seizures - in October of 2023 - was caused by me getting the latest COVID-19 vaccine at the time, it was a little <em>too</em> convenient that I had my second pair of seizures - the first of which dislocated my right shoulder again, and the second resulted in a forceful relocation via falling onto it - mere days after getting that year’s vaccine.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>And so, as far as I’m concerned, I’m at greater risk for COVID-19. Because I’m scared of getting the updated vaccine each year, and rolling the dice that I won’t have seizures because of something that COVID-19 does to my brain. I didn’t get it in 2024, and I probably won’t get it this year either - not because I don’t <em>want</em> to, but because I genuinely think it puts me at a risk that I don’t want to take. Especially when every single seizure I have ever had, including one I had literally three weeks ago that dislocated my right shoulder <em>FOR THE THIRD GODDAMN TIME</em>, has seriously injured me in some way. While I didn’t have a seizure when I had COVID-19 yet again at the start of March 2025, I can likely attribute that to the high as hell doses of anti-convulsants that I take to prevent seizures from even thinking of happening.</p>\n<p>My seizure a few weeks ago was set up by me not taking my medications because I oops, ran out and didn’t refill in time, so at least I know they’re working? But that just reaffirms that I have a seizure disorder. One that was probably set in motion by COVID-19, and may or may not be getting worse each subsequent time I get COVID-19… or even experience anything similar to it.</p>\n<p>Did I need to share all of that? Probably not, but I really just want to lock in that people who aren’t taking public health seriously at conventions - both the attendees and the folks running them - lead to folks who either put themselves at great risk if they attend, or simply can’t even dream of attending because nobody is doing their part to make it remotely safe for them.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying face-down on the ground, with a low battery symbol above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying face-down on the ground, with a low battery symbol above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h3 id=\"i-am-not-alone-in-this-concern\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/public-health-at-large-cons/#i-am-not-alone-in-this-concern\">I am not alone in this concern.</a></h3>\n<p>It doesn’t even have to be COVID-19. It can be norovirus, it can be the flu, it can be a particularly nasty cold, it could be a stomach bug, it could be some novel virus nobody has heard of and now conservatives are calling it something stupid because it happened at some nerd convention. All that matters is that, so long that people don’t protect themselves at conventions, both at the event as well as travelling to and from the con, it makes it harder for folks like me to feel safe.</p>\n<p>There’s a con near me that kicks off every Memorial Day weekend, and I really wanted to go this year (despite financial problems) - even for just a day - but I’m concerned for my health because I don’t know how seriously folks take shit like masking up. Not just for COVID, but for so many other illnesses. And I’m in the camp where I can at least think about going to a con, so long that I take every precaution possible. Many others are not in the position I’m in. Many others can’t go because if they get sick, there’s a strong change they’ll be hospitalized.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\" alt=\"Senil curled into a ball, crying. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil curled into a ball, crying. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>I may end up being one of those people one day, if I roll a seven on the cosmic dice of my health and I get diagnosed with the same autoimmune disorder my mother has. Which is somewhat likely given that I might also have EDS, which is a potential indicator of rheumatoid arthritis down the line. I hopefully won’t develop RA, but who knows.</p>\n<p>So, in the meantime… I, alongside many others, beg of everyone who goes to conventions:</p>\n<h2 id=\"please-take-health-your-own-and-of-others-seriously\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/public-health-at-large-cons/#please-take-health-your-own-and-of-others-seriously\">Please take health - your own and of others - seriously.</a></h2>\n<p>This shit is serious. We’re in a time where the political support for public health is declining, as we have conservatives in power who think <a href=\"https://blog.senil.me/public-health-at-large-cons/\">some types of vaccines should be outlawed</a>, that <a href=\"https://blog.senil.me/public-health-at-large-cons/\">fluoride should be removed from water supplies</a>, that <a href=\"https://blog.senil.me/public-health-at-large-cons/\">funding and backing programs like Medicaid is a waste of money</a>. We shouldn’t be doing the work of conservatives for them by giving up on what measures we personally can take.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Everyone needs to be doing what little they can, even if it’s just at conventions. Mask up with at least a proper N95 or equivalent from a reputable source. Make sure it’s sealed properly. Don’t go <em>at all</em> if you’re sick - even if you just stay in your hotel room the entire time to protect other attendees, you’re putting others who are travelling alongside you at risk, too. Yes, not going probably means losing money from non-refundable travel fees, but you not getting horribly ill far away from home alongside risking the health of others is, in my opinion, worth that loss.</p>\n<p>(This is also why you should try to have a backup plan in place if something does happen. Yes refundable flights or train tickets are more expensive, but you’ll at least get some money back if shit does hit the fan before you leave.)</p>\n<p>Every immunocompromised person - or those at risk of <em>becoming</em> immunocompromised - is begging y’all to take things seriously.</p>\n<p>I want to feel like I can safely go to conventions, too. A lot of people want that. But we see y’all not doing the bare minimum, and so we have to choose between taking a gamble on our health, or just not going and missing out on seeing folks in-person.</p>\n<p><strong>So please, please do what you can to protect us, too.</strong></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\" alt=\"Senil hugging a big pink heart. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil hugging a big pink heart. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>",
      "date_published": "2025-06-09T00:00:00Z"
    },{
      "id": "https://blog.senil.me/megacon-musings/",
      "url": "https://blog.senil.me/megacon-musings/",
      "title": "(Some) cons are growing too big, too fast.",
      "content_html": "<p>Furry Weekend Atlanta (FWA) has had its biggest year yet now, with roughly 17,700 attendents this year. A select few furcons are growing at a rapid pace, and I’m getting increasingly concerned that nobody - either anyone running the con, people on the floor supporting the con, or even congoers themselves - is aware of the strain this is putting on the cons themselves, the community as a whole, and the growing public health risks that large cons present in general.</p>\n<p>This is going to be a ranty, rambly post y’all, just so you know. There are many thoughts, many of which are disjoint from each other. I just want to collect everything into one place, that I may update over time (or just make long posts collecting a new batch of thoughts). And as a disclaimer, I am not at all familiar with con operations or the backend of any conventions beyond things I’ve heard from the occasionial con-ops folks on Bluesky and the Fediverse. I don’t have experience running anything like this, but I feel like it doesn’t take that kind of knowledge to realize the problems here.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"furcon-growth\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/megacon-musings/#furcon-growth\">Furcon Growth</a></h2>\n<p><a href=\"https://soatok.blog/2024/05/30/furries-are-losing-the-battle-against-scale/\">I’ll leave a lot of the raw numbers and speculation up to Soatok’s great blog post from last year</a>, where FWA had doubled in size between 2022 and 2024. The “too long; didn’t read” that’s relevant to me and my thoughts is the doubling rate - cons are growing too big, too fast, at a rate that I highly doubt is sustainable. Soatok had speculated that FWA would double in size in three years going off of <em>a decade of growth</em>, which includes the dip caused by COVID-19. While three data points is hardly anything to work off of, one con gaining <em>ten thousand attendees</em> in the span of three years raises some orange flags when it comes to how well they’re handling things. Nobody likes spending half of their con experience waiting in registration lines, or for the elevators, or for goddamn <em>stairs</em>.</p>\n<p>So people rightfully complain about the lovingly named “line-con” and “elevator-con” that routinely happens at these large-scale furcons.</p>\n<p>And yet, when people DO complain about line-con and elevator-con, especially when it comes to Furry Weekend Atlanta, folks bring up that the same and location and venue hosts Dragoncon - a week-long nerd convention covering all sorts of things that draws in roughly 70,000 people from all over. Surely Dragoncon is even worse than FWA in those aspects, right? Well, I don’t know if Dragoncon suffers from line-con and elevator-con (I imagine they do, but to what extent I don’t know), but here’s the thing: They have hundreds of volunteers to help make the convention happen. Allegedly around 1,500 people, per their website. I don’t know how many volunteers cons like FWA have to make things happen, but I have a pretty strong suspicion that it’s nowhere near enough.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h3 id=\"volunteer-and-staff-burnout\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/megacon-musings/#volunteer-and-staff-burnout\">Volunteer - and Staff - Burnout</a></h3>\n<p>I occasionally read some thread of ex-volunteers who got burnt out because of how much was asked of them at a con. At how much work they had to take on, or how many areas they were responsible for that they weren’t expecting. At how they loved making things happen, but volunteering was so much work that they couldn’t actually enjoy being at the convention itself. That’s how you burn people out from volunteering. I don’t know what all causes this burnout at various cons - it could just be understaffing, it could also be a lack of training or unclear direction from higher-ups - but whatever is going on is simply unsustainable, <em>even without considering the rapid growth</em>.</p>\n<p>(aside: at least regarding specifically FWA, someone who was assisting a disabled person only ever got reliable information from actual con-staff; volunteers were not consistent sources of info. If you manage FWA, get your volunteer training up to snuff, because that’s unacceptable.)</p>\n<p>I don’t think it would matter if huge conventions like AnthroCon, Furry Weekend Atlanta, or Midwest FurFest keep growing at the rates they are. They’re already big enough where their operations are getting strained, and the few people they have to make things happen are finding it difficult to keep volunteering because they spend their entire time working or recovering from the stress of being on the floor.</p>\n<p>Hell, even people on the backend are struggling, as evidenced by FWA releasing a new virtual check-in system that promised to cut down on waiting in lines for all sorts of things. It failed miserably at that task, so it ended up being a massive “fuck you” to everyone who has struggles standing in lines. Imagine being on the (almost certainly miniscule) team that was responsible for setting that up. I can’t imagine seeing something that you’ve worked on - or partnered with - fail so miserably that it genuinely would’ve been better to have not tried. I have a gut feeling that this idea won’t be tried by any other furry megacon any time soon, after how poorly Furry Weekend Atlanta implemented it.</p>\n<p>Perhaps it would have been better for a smaller con to give that system a try first, or to implement the virtual queue system in a more limited capacity to see what breaks it.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying face-down on the ground, with a low battery symbol above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying face-down on the ground, with a low battery symbol above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>For conventions that keep burning out their volunteers, we live in an age where people can easily talk about their burnout, how bad it is, and how long it’s been a problem. People can talk about how they were brought on to help advise operations, but were dismissed because they suggested the bare minimum of changes to help things out. And so anyone who <em>might</em> otherwise volunteer for the convention, because it’s local to them and they want to help make it run, could see the stories of how things truly are from the view of people who do help out a convention, and they end up never volunteering as a result.</p>\n<p>This creates an endless cycle of struggling to bring on volunteers, burning out the ones you do have over the years, their stories reaching people who might become volunteers, and then people end up not helping… which I’m certain you can see where this is going, because I’ve been beating this dead horse for this entire section.</p>\n<p>We (the royal We) are not prepared to handle these kinds of conventions if we don’t change our attitude about managing them. We cannot have conventions with 17,000 attendees if they can’t be run like a convention with 17,000 attendees.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\" alt=\"Senil curled into a ball, crying. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil curled into a ball, crying. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h3 id=\"more-conventions\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/megacon-musings/#more-conventions\">More conventions?</a></h3>\n<p>In Soatok’s excellent blog post, he mentions that there just isn’t the supply of additional conventions to - in my words - even out the load that large cons get. While I agree that more cons and more local events equals more better (and more accessible, more on that later), I don’t think that’s the right angle to view how to manage the strain of megacons on the community.</p>\n<p>I doubt that any number of new cons or local events will slow down the growth of these large cons because - even ones as “small” as Anthro New England with “only” 5,000 attendees (or my local convention, Furlandia, which has also grown to around 5000 attendees) - are quickly becoming hot spots to go to. They’re places for folks to meet with friends from around the nation, or even around the globe. People who can’t go are experiencing FOMO in greater numbers because they can’t make it - for any number of reasons. Artists who rely on big conventions are finding it harder and harder to get in and make sales that they might’ve been able to rely on in years past. It’s less about the convention itself, and more about it being a large social gathering. <strong>It’s less celebration, and more destination.</strong></p>\n<p>(I’m going to be real, I’m not entirely sure what I mean by that, but hopefully you know what I mean by that. If you don’t, then we’re both lost.)</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Even trying to spin up more virtual events - either general VR cons like Furality, or more “tailored” virtual events such as a massive TTRPG table session - might not help, because <em>those aren’t the hot spots to meet folks in person.</em> It might create more opportunities for folks in a general region to meet up, but it won’t diminish the scale that these megacons have to offer for people far and wide.</p>\n<h3 id=\"whatever-the-hell-anthrocon-is-doing\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/megacon-musings/#whatever-the-hell-anthrocon-is-doing\">Whatever the hell Anthrocon is doing</a></h3>\n<p>This is going to be brief, but Anthrocon, in what I can only assume is an attempt to shrink the size of their growing fursuit parade, has decided to ban “poodling”, or showing any skin on your suit. They’ve also limited the number of handlers allowed in the parade, despite uh. Fursuit vision being VERY limited, and everyone realistically benefiting from more handlers involved.</p>\n<p>I personally have no skin in this game, as I don’t even own a partial of any kind (though stay tuned for when I eventually build a custom synth head), but it’s sparked a lot of backlash for both how vague their new rules are, as well as outright banning a way for people to try and keep cool during a parade. That takes place in the middle of summer. Outside. Where it will be Very Hot.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\" alt=\"Senil sprawled on his back, sleeping. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil sprawled on his back, sleeping. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>There are some other… questionable changes - no flags, for one, which one can assume is to try and keep political flags out (or specifically Palestinian flags to show support) but is so vague that it could just be any flag they dislike - but those have nothing to do with the sheer size of the parade.</p>\n<p>What I’ve heard some conventions do is to simply nix the fursuit parade, and greatly expand their block parties and group photos. It’s presumably easier to manage a larger block party than a parade, same with large-scale photos of every fursuiter who wants to be in it. Parades are difficult to handle - trust me, I’ve marched in plenty, they’re VERY difficult logistically - but they also bring in good press for Anthrocon. Some have suspected that them banning poodling is to try and appease to non-furries, which might be true, but also it might not be. We don’t know the decisions made, who all was involved in them, why they were made, how their logistics and con-ops changed to suit things, etc. Nobody can - or should - perscribe any meaning to their actions other than “hey that’s kinda fucked up.”</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"what-s-next\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/megacon-musings/#what-s-next\">What’s next?</a></h2>\n<p>Ultimately, I don’t think there’s really a way to “solve” the problem of cons getting big. It’s not that megacons exist - there is definitely space for them in furry. It’s that they’re growing too <em>fast</em>, putting more strain on con-ops that they were already dealing with. We’ve seen how room lotteries work out when people all queue up for the site and immediately crash it. We’ve seen how poorly FWA’s virtual queue rolled out - to the point where people spent <em>more time</em> working with the queue system than if they just. Stood in a line. We’ve seen volunteers with insufficient knowledge - not even a “Hey, this is outside the con’s purview, but this is something the hotel/convention center handles, they’ll know this.”</p>\n<p>Hell, even virtual conventions like Furality routinely break VRChat’s backend - not necessarily because their con is too big, but rather because the backend systems they rely on can’t handle the load that they bring on. VRChat brings in a ton of money from Furality year after year, but fails to make sure their backend - both their own systems, as well as the systems they themselves rely on - can handle the load that this growing virtual con brings.</p>\n<p>I suppose that’s ultimately what my frustrations and concerns boil down to. The people and systems that “make the magic happen” are getting overloaded year after year. They’re both trying to do what they can, yet also occasionally making nonsensical choices to try and improve things - or actively do things that make the con experience worse in some way.</p>\n<p>I don’t know, this is all rambly and ranty and I have absolutely no experience on any relevant front. This is me just shitting stuff out and hoping I’m at least kind of on to something, and that maybe. Just maybe. Folks who have actual influence with con-ops are able to make meaningful changes to improve the experience for their rapidly growing conventions.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\" alt=\"Senil hugging a big pink heart. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil hugging a big pink heart. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>",
      "date_published": "2025-06-09T00:00:00Z"
    },{
      "id": "https://blog.senil.me/esphome-google-mini-initial-thoughts/",
      "url": "https://blog.senil.me/esphome-google-mini-initial-thoughts/",
      "title": "Google Home Mini to ESPHome - Hardware Selection",
      "content_html": "<p>If you didn’t catch me posting about this earlier this month, I’ve been thinking about turning my 1st gen Google Home Mini (NOT the Nest Mini, that’s the second gen) into a ESPHome-powered voice assistant to link up to my Home Assistant. There’s many, MANY steps involved here, from just designing the damn circuit board to fleshing out the workflow via Home Assistant, but every project has got to start somewhere.</p>\n<p>And hardware selection, since I have zero good reference points as far as I know, is the best place to start.</p>\n<p>Since this is so goddamn long, here are some quick links to jump to different main sections:<br />\n<a href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#the-google-home-mini-itself\"><strong>The Google Home Mini Itself.</strong></a><br />\n<a href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#the-brains-of-the-operation\"><strong>The Brains of the Operation.</strong></a><br />\n<a href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#the-audio-system\"><strong>The Audio System.</strong></a><br />\n<a href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#some-bonus-features-for-the-mini\"><strong>Some Bonus Features for the Mini.</strong></a><br />\n<a href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#timeline-and-challenges\"><strong>Timeline and Challenges.</strong></a></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"the-goal\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#the-goal\">The Goal</a></h2>\n<p>The ultimate goal of this project is to design, develop, and test a more-or-less drop-in mainboard for a first-generation Google Home Mini that’s based on ESPHome, with minimal-to-no chassis modifications so it truly is plug-and-play.</p>\n<p>ESPHome, a project by Nabu Casa (who also works on Home Assistant), is a platform to easily add DIY devices to Home Assistant. The goal is simple programming via YAML, and every device has a standardized “firmware” of a sorts for end users to add on to. Since this is going to be a brand-new implementation, I get the joy of developing that “firmware” myself.</p>\n<p>OK, it’s not REALLY firmware, it’s just a way to set up board-level naming and such so it’s easier to work with in YAML, but still. I’ll be the one responsible for this shit. Yippee!</p>\n<p>So, let’s talk about the main parts that will be worked on.</p>\n<h2 id=\"the-google-home-mini-itself\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#the-google-home-mini-itself\">The Google Home Mini Itself</a></h2>\n<p>If you’ve never cracked open a Google Home Mini, you’re missing out on some clever engineering work. The mainboard itself is incredibly compact, with a very, VERY thin PCB and support components on both sides. The metal frame that it sits on (which the speaker points up at to get that 360 degree mono audio) is perfectly crafted for the big capacitors and speaker connection port to sit in, without touching the rest of the board. It’s clever, really, but that means I have to work around the existing metal frame.</p>\n<p>There’s also a tiny little board where the micro-USB plug sits that sends in power, has an itty bitty reset button to wipe the configuration of the device, and a physical switch to turn the microphone on and off. I need to investigate the board further, but it looks like the board only sends through 5V USB power, the reset button, and the mic on/off switch. Since I want users to be able to update the Home Mini without having to tear it apart, I’ll also end up designing a new board that uses USB-C instead and passes through data to the mainboard.</p>\n<p>Regarding that microphone on/off switch, I can’t tell if it ends up physically disconnecting the microphones somehow, or if it’s just a software thing. Since I’ll be designing a new power board, I might as well try to make it a full-on mic disconnect, instead of a software “stop listening, damnit.” If I can’t find a way to physically disconnect the microphones, then I’ll get the joy of figuring out where I can software disconnect things.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying face-down on the ground, with a low battery symbol above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying face-down on the ground, with a low battery symbol above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>There’s a handful of LEDs that the Mini lights up when it’s thinking of your request, as well as change as you adjust volume via two… capacitive? pressure? pads on the left and right sides by the microphones. I have no idea how I’m gonna handle those with ESPHome, but there’ll be four nice little lights sitting there regardless.</p>\n<h2 id=\"the-brains-of-the-operation\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#the-brains-of-the-operation\">The Brains of the Operation</a></h2>\n<p>There are several options at my disposal for making this ESPHome board - I could use an ESP32, I could toss in an RP2040 and a separate WiFi chip, I could do some wacky third thing - but of the existing Home Assistant Voice examples, all of them use some version of the ESP32-S3 chip. There are also plenty of other products that make use of it, so I’ll at least have a reference point for how the thing works.</p>\n<p>However, I do still have a choice to make. I can get the ESP32-S3 chip itself, and add on the necessary support components as I want - being the flash memory, wireless antenna, and all that jazz. Or, I can get a complete module that contains the ESP32-S3, the flash memory, and - if I want - an on-module antenna. There’s a version with a u.FL snap too, but then I’d have to figure out where the hell I’m going to shove a separate antenna into this tiny ass thing.</p>\n<p>Given that I don’t know what the hell I’m doing - I’m a controls engineer by trade, not a PCB designer - I’ll be going with the module that includes (most) of what I need for the brains of it all. There’ll be plenty of other support components for the module, but nowhere near as many for me to manage compared to using the individual chips.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"the-audio-system\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#the-audio-system\">The Audio System</a></h2>\n<p>What good is a mainboard that hooks up to ESPHome that I want to be a voice assistant that can’t handle audio? Fortunately the Google Home Mini comes with its own 4-ohm 3-watt speaker that, while it doesn’t sound incredible, is at least serviceable and does alright given its dimensions. It’s casing is actually molded to wrap around other components it sits by, so that’s a design constraint on some components. It also isn’t hardwired into the existing mainboard, which makes my life a LOT easier.</p>\n<p>So while my speaker situation is well managed… I still have some microphones to deal with. The Google Home Mini gets away with just two - one on each side, with the case funneling the microphones into a more directed fashion for… reasons, so I have faith I could get away with just two as well. If I added more, I’d need to both figure out where they’re going to go, as well as how they’re going to listen in. Two good mics should be more than enough on that front.</p>\n<p>But wait a second… this is going to be a voice assistant that does wake word stuff on its own (I could pipe an audio stream to Home Assistant, but that means keeping an active network connection 24/7), and there are only so many resources to go around. I can’t just program in beamforming algorithms and other audio processing systems into a chip that’s already burdened with everything else that relates to being a voice assistant.</p>\n<h3 id=\"enter-the-xmos-xu316\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#enter-the-xmos-xu316\">Enter the XMOS XU316</a></h3>\n<p>The XMOS XU316 is a powerful microcontroller with one job in mind - voice processing. It has a ton of useful, baked-in tools that would be way too annoying for me to program and understand on my own - let alone implement into an ESPHome system that I’m already unfamiliar with - and passes through clean audio that the ESP32 can work with (by shoving it to Home Assistant).</p>\n<p>The XU316, <a href=\"https://www.xmos.com/xcore-voice\">per XMOS’s website for it</a>, does acoustic echo cancellation via it’s two-mic input, runs automatic gain control, handles noise supression, and can pass all of this out via I2S. Oh, and it’s also technically a USB Class 2 audio device. Not like that’s something I’ll be using here - the ESP32-S3 can work with I2S for audio, so the XU316 will just pass data along that way.</p>\n<p>Mostly easy-peasy! A chip that handles (most) of what I need, easing the burden from the ESP32 that’ll be handling a built-in wake word and networking. And may or may not be managing additional features that I would love to integrate, but may or may not be able to.</p>\n<h2 id=\"some-bonus-features-for-the-mini\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#some-bonus-features-for-the-mini\">Some Bonus Features for the Mini</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\" alt=\"Senil flexing his biceps, smirking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil flexing his biceps, smirking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>There are a variety of nice, quality-of-life features that’ll take this board from a basic drop-in, and turn it into a proper upgrade built for Home Assistant from the get go. All of these are things that I would LOVE to add, but simply might not be able to. Both because of how little space I have to work with, and because I probably don’t know what I’m doing.</p>\n<h3 id=\"smart-home-wireless-protocols\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#smart-home-wireless-protocols\">Smart Home Wireless Protocols</a></h3>\n<p>Something that the Google Home Mini lacks is any ability to connect to act as a hub for smart home tech. It’s merely a voice assistant, it can’t connect to jack shit without you owning a separate hub to handle smart home protocols like Zigbee, Z-Wave, or Thread.</p>\n<p>And so, a nice quality of life upgrade would be to build in a router for Zigbee and/or Thread to the mainboard. This at least gives the board a value-add, outside of “I want to keep this thing but de-Google it,” something that I think is important for any kind of project like this. If your setup works as-is with Google Home and/or Home Assistant, why would you bother modifying your Home Mini to do this?</p>\n<h4 id=\"zigbee-and-thread\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#zigbee-and-thread\">Zigbee and Thread</a></h4>\n<p>Zigbee is the obvious choice to add as a router. It has a wide ecosystem to work with, and can easily talk to Home Assistant via the MQTT integration. It’s also very well understood, and I’d have plenty of reference implementations to work with, cutting down on the labor involved in integrating the damn thing.</p>\n<p>Thread is up and coming, built to be low power and tightly integrated with the Matter ecosystem. I’ve personally taken interest in Matter largely because of how comprehensive it is, but I take serious issue with how Google, Apple, and Amazon - all members of the organization that develops the Matter specifications - neglect to implement the Matter spec in full. Only Samsung’s SmartThings and Home Assistant fully implement the latest Matter specs, and giving this Google Home Mini an upgrade to not only act as a hub for smart devices, but to have built-in support for a growing protocol with Home Assistant would be a good value add in my opinion.</p>\n<p>I can, of course, set it up to do either Zigbee or Thread, since both use 2.4GHz for networking, which would hopefully cut down on the design work and hardware integration.</p>\n<h4 id=\"z-wave\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#z-wave\">Z-Wave</a></h4>\n<p>Z-Wave is the final option available to me, and it’s one that I’m a little more hesitant to include. Z-Wave has nowhere near the ecosystem support that Zigbee has, nor does it have the growth that Thread/Matter enjoys, but it does have a major advantage over both. It doesn’t use the increasingly cluttered 2.4GHz channels, instead opting for lower bandwidth and less cluttered sub-1GHz bands. Sure, Z-Wave isn’t as “fast” as Zigbee or Thread can be, but it can boast a much better coverage radius than either, ideally meaning it needs fewer permantently powered devices to maintain a good mesh network with wide coverage. Hell, the newest Z-Wave specification has an effective radius of over a kilometer.</p>\n<p>I don’t think any Z-Wave implementation in a Google Home Mini is going to have quite that range, but it would boast a large range and (ideally) less clutter than Zigbee or Thread.</p>\n<p>Z-Wave does have a downside in that exactly one company owns the designs for Z-Wave hardware and radios and shit, severely limiting my hardware selection when it comes to the “how the fuck do I shove parts inside this thing” step of this project.</p>\n<h3 id=\"built-in-sensors\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#built-in-sensors\">Built-in Sensors</a></h3>\n<p>This is much lower on my desire list than somehow baking in a smart home protocol, but having some sensors that are automagically included would be a nice benefit. I don’t know what I could realistically add - temperature and humidity would be easily influenced by the heat of the other components, presence detection would be difficult without modifying the chassis, same as ambient light - but if there’s the space to add something, and make it something useful for where you might put this kind of thing, then I’d love to add it.</p>\n<p>This could easily be adding many more support components though, and figuring out how to cram even more into the already probably crammed mainboard would be… Difficult, to say the least.</p>\n<h2 id=\"timeline-and-challenges\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#timeline-and-challenges\">Timeline &amp; Challenges</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\" alt=\"Senil pointing towards the viewier, winking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil pointing towards the viewier, winking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>There isn’t really any “goal” for when I want this thing done. All I know is that step one is to lock down exactly what parts I need, and then get to work designing circuit boards in some sort of PCB CAD software. And… then hope that I can get these boards built and assembled for relatively cheap despite the ridiculus tariffs in place.</p>\n<p>I would love to both open source the designs and programming for this project, and maybe sell the boards myself (acting as an intermediary between some PCB manufacturer and assembler, programming and testing them, and shipping them off) so folks can get in on de-Googling (and de-Amazoning) their smart homes and voice assistants.</p>\n<p>Having a mostly drop-in board that Just Works out of the box (barring Home Assistant Voice quirks, I can’t control those) and hopefully has a high partner approval factor so it’s easy to get used to would be fantastic. And maybe, just maybe, my design will lead to folks spinning it off and making similar drop-ins for other voice assistant products from Google, Apple, and Amazon.</p>\n<p>The best time to build our own assistants was years ago. The second best time is right here, right now.</p>\n<h4 id=\"thank-you\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/esphome-google-mini-initial-thoughts/#thank-you\">Thank you</a></h4>\n<p>If you’re reading this, you made it to the end of the (very long) post. Thanks for reading this gigantic rambly nonsense. If you have circuit design experience, know of a good PCB factory and assembler, or have projects you know of that would be a great source of inspiration, PLEASE feel free to reach out to me. I’m available in a lot of places, so poke me on Bluesky, Fedi, Telegram, Discord… <a href=\"mailto:hello@senil.me\">even email, if you want!</a></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\" alt=\"Senil hugging a big pink heart. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil hugging a big pink heart. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>",
      "date_published": "2025-05-25T00:00:00Z"
    },{
      "id": "https://blog.senil.me/happy-new-year-plans/",
      "url": "https://blog.senil.me/happy-new-year-plans/",
      "title": "Happy New Year! 2025 Plans",
      "content_html": "<p>Well, it’s 2025 now I guess. A lot is happening in my life - mostly moving to a totally new city to start a job after <strong>seven months</strong> of hunting, but that’s besides the point. There’s some things that I actually want to make happen this year, and what better way to share that than a ramblingly long post?</p>\n<h2 id=\"get-back-to-streaming\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/happy-new-year-plans/#get-back-to-streaming\">Get back to streaming</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\" alt=\"Senil hugging a big pink heart. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil hugging a big pink heart. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>This is something I’ve been wanting to do for many, MANY months now. The last three-odd years have just been chaotic with graduating university, finding work, having seizures that threw a ton of shit in the garbage, leaving that job voluntarily, and then trying to find a job for months made it pretty damn hard to find some what to vaguely consistently hit “Start Streaming” in OBS.</p>\n<p>Hopefully, with a new job and a place to call home again, I can hit that button again. Even just once or twice a week will make me happy, I miss doing whatever and hanging out online. Especially now that my Video Game Interests are expanding beyond Splatoon 3 and Minecraft - I’ve been enjoying Warframe a bunch recently, and also want to get better at Mario Kart 8 Deluxe - they’ll hopefully be a bit more varied, too.</p>\n<p>I want to do some build/code streams at some point as well, but that’ll be for the splatling projects, so those won’t happen for a LONG time.</p>\n<h2 id=\"try-to-build-shit\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/happy-new-year-plans/#try-to-build-shit\">Try to build shit</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Even just basic stuff, I want to start learning some techniques that’ll bring future projects to life. I want to learn some 3D modeling and get a better sense of picturing a 2D image of a 3D object into actual 3D space in my head. Sure I can rotate the cube in my mind but that doesn’t mean I can really get a sense of scale and what the finished result will be.</p>\n<p>The only real use-case of VR (slash XR) for me, outside of gaming and socalizing, is literally this. To be able to see how big something is compared to myself or some other object so I can get an actual sense of scale, instead of just having to remember “it’s going to be this big.” That kind of visualization would also help a lot when it comes to decided how to handle finer detail - does it need to be modeled and printed, can it be painted on, how might this really look?</p>\n<p>I need an AutoCAD plugin to do this for my future headset, I want that shit so badly even if it’s relatively basic. Like, y’all have NO IDEA how much I’d love a tool that lets me see what I’ve modeled to-scale.</p>\n<h2 id=\"get-more-involved\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/happy-new-year-plans/#get-more-involved\">Get more involved</a></h2>\n<p>Something that I kind of resented about my time where I lived for my previous job was that I just didn’t really get involved in any kind of community. I know that was largely out of my control - it was a somewhat rural area focused around two universities, one large corporation, and the support systems in place to handle those existing. Being unable to drive there killed my personal ability to do things out and about, and build more relationships in-person. That fortunately won’t be a problem where I am now, though I still need to put the effort in to make those connections.</p>\n<p>I also want to get more involved online as well. I have a kind of nasty habit of just passively Existing in spaces, and not really being a part of them in the way I kind of wish I could. This one’s a little harder to predict or plan for since it depends on my real-life engagements as well as “how much time and energy do I have after work” because yay, capitalism in the USA demands that we put our focus on work over life.</p>\n<h2 id=\"build-a-better-tomorrow\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/happy-new-year-plans/#build-a-better-tomorrow\">Build a better tomorrow</a></h2>\n<p>This one is, well, pretty damn vague, though it’s extremely relevant given the last three weeks of the current Trump administration in the United States. I want to try to leave things better than they were when I saw them - from the tiniest of things, to local organizing, or whatever that entails. The world’s a fucked up place right now, and I want to try to do what little this synth can in order to make things even just a little bit better.</p>\n<p>This somewhat ties in to wanting to get more involved - not only do I want to build up better in-person and online social groups, I want to get involved in local politics here, because I have very little faith in anything I do having much impact on the federal scale. I… have Thoughts regarding federal politic that I shan’t go in depth here, but the TL;DR is that I don’t trust the current establishment to fight for us tooth-and-nail, and many of those who <em>claim</em> (or were “marketed” as) to be progressive have been proving they aren’t as in our camp as I think many folks wanted them to be.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>But that’s neither here nor there, the rest of this post would be me bitching about politic if I don’t stop myself right now.</p>\n<h2 id=\"prepare-for-the-future\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/happy-new-year-plans/#prepare-for-the-future\">Prepare for the future</a></h2>\n<p>I’ve now formally given up the idea of being able to retire from work, given the overall instability of the Everything these days, which sucks because it’s a little nice to plan for that, but also retirement is fucking EXPENSIVE y’all. And since it seems like that’s a pipe dream (just like owning a home is kind of one, c’mon let there be another housing crash), I figure I might as well start thinking a bit about what I want things to be like in twenty, thirty years. Nothing is going to be set in stone, but rather just starting to think about those &quot;what if?&quot;s that come with this kind of long-term thing.</p>\n<p>Maybe I’ll still be a controls engineer, maybe I move to being a consultant or work for a small-town utility, or I just build shit for folks online like I already plan on doing with splatlings and similar Splatoon weaponry. Or synth partials, or the parts for them if I ever figure that shit out and have the space to do that.</p>\n<p>Stuff like that, y’know? Silly things that would be less tasking in some form than what I do currently (or would do in 20 years), but still make a bit of money and be fun to do, instead of menial labor. The last thing I want is to end up forced to work a back-breaking minimum wage job in my 70s. My back is already fucked up and has been for a few years, I can’t imagine what it’ll be like in four decades.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"host-shit-for-friends\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/happy-new-year-plans/#host-shit-for-friends\">Host shit for friends</a></h2>\n<p>Going back towards more immediate thoughts and goals, I want to start self hosting things for friends for realsies this time. I have a <a href=\"https://drive.proton.me/urls/F3GW29PEYC#8EBoxqdeFrFm\">five-page document</a> going over the rough hardware plan as well as the software I’d feel comfortable running and what hardware I’d want before doing so.</p>\n<p>I currently want to run some form of microblogging Fediverse software - either IceShrimp dotNET or Sharkey - and eventually Peertube for folks as well. I plan to host some local stuff for just me and my fiance down the line, but that’s a much later me problem. In the meantime when it comes to hosting stuff, I’m vaguely helping someone with running the <a href=\"https://videowisent.maw.best/\">VideoWisent Peertube</a> instance, and what I’m learning with that will come to my aid when I run Peertube for myself and friends.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\" alt=\"Senil flexing his biceps, smirking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil flexing his biceps, smirking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h3 id=\"well-that-s-all-folks\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/happy-new-year-plans/#well-that-s-all-folks\">Well, that’s all folks!</a></h3>\n<p>I hope this 2025 goes better than 2024 for us all, despite the fascist in office right now that’s working to demolish the US government and hurt every vulnerable person there is here. While also destroying relations with pretty much every foreign country imagineable.</p>\n",
      "date_published": "2025-02-08T00:00:00Z"
    },{
      "id": "https://blog.senil.me/tech-should-just-work/",
      "url": "https://blog.senil.me/tech-should-just-work/",
      "title": "Some thoughts on &quot;software for non-techies&quot;",
      "content_html": "<p>This blog post is a refined version of my thread from booping.synth.download, regarding <a href=\"https://retro.social/@ifixcoinops/113790985784272965\">this specific post that I stumbled across</a>, and wanted to expand on it with my own thoughts in agreement with OP.</p>\n<h2 id=\"normal-people-tech-nerds\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tech-should-just-work/#normal-people-tech-nerds\">Normal People != Tech Nerds</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>If you want your software to be used by Normal People (and you aren’t in an industry environment where slightly more specialized things are going to be training anyways), you gotta approach them on Normal Person Terms. The biggest one being “does this new thing still do what I needed the original for” paired with “can I just hit install and get going with no fuss.” Very few Normal People sign up for a social network because privacy or some other abstract reason. They sign up because their friends are there and they think it’ll be a good community. They stick around if the culture is good and the system is Intuitive.</p>\n<p>They do not care about much otherwise. Which is ok! I’m the same way with certain things in my life - I’m willing to fight some to make shit work how I want it to, instead of how (insert random company here) wants it to, but 87% of the time I just want shit to work.</p>\n<p>Sure, I could use Linux on my desktop when I set it up again, but I want to use CAD tools that are kinda the industry standard here, which means AutoDesk, which means no Linux. There are hacky ways to make it work, but I’d be fighting it enough as is. I don’t need getting the thing to run to be part of it.</p>\n<p>Y’know why most Normal People don’t use Signal or Matrix or whatever? Because a) their friends and family probably aren’t on it, b) that is Yet Another Place to keep tabs on, and c) <em>it doesn’t really do anything else for them.</em> Assuming it even works half the time, too (<em>cough</em> matrix <em>cough</em>)</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"stop-assuming-shit-y-all\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tech-should-just-work/#stop-assuming-shit-y-all\">Stop assuming shit y’all</a></h2>\n<p>Approach folks where they’re at. You aren’t going to get people who just want to talk to their friends to sign up for a social platform that talks way too much about the backend and not enough about what it does and its features and how nice it is to use and find friends and communities and whatnot. They don’t care about federation, they just want to hang out.</p>\n<p>I’m so annoyed by anyone who assumes that Most People just want their tech to work and not fight it. It’s part of why any local self hosting (for others) is going on micro boxes that sit behind another one on a totally different physical network that’s regulated by the larger box. Sure I could fuck around with vlans and ports and access restriction and shit, but it’s way easier for me to just go “this is the literal only thing that’s physically part of the rest of my network, it’s the only thing that gets to talk to the outside world, and it’s the thing in charge of handling everything else.”</p>\n<p>I’d be fighting that box (&amp; the others) enough as-is. I don’t need to be juggling shared physical networking stuff to try and keep things otherwise separate and secured. And I’m already technically minded.</p>\n<p>I don’t care about the backend about a lot of things unless it’s a personal project, I’m paid to care about it, or the ADHD kicks in. I just want shit to work &amp; anything that prides itself too much on the backend without talking about the actual experience (let alone “what does that mean for the end user”) is an Orange Flag for me.</p>\n<h2 id=\"i-m-like-the-wrong-person-to-argue-this\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tech-should-just-work/#i-m-like-the-wrong-person-to-argue-this\">I’m like, the wrong person to argue this</a></h2>\n<p>Yes this is kind of rich coming from the guy who wants to fuck around and install postmarketOS onto a ChromeOS tablet (an HP Chromebook x2 11 in particular), but the only reason I really care to fuck around with that is a) it sounds interesting, and b) <em>I don’t care about that tablet anyways</em>. It sits unused, it doesn’t do shit 99% of the time these days as is. If I fuck it up, it’s not a massive loss on my part.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h4 id=\"a-lot-of-folks-don-t-have-that-ability-to-fuck-around-and-find-out\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tech-should-just-work/#a-lot-of-folks-don-t-have-that-ability-to-fuck-around-and-find-out\">A lot of folks don’t have that ability to fuck around &amp; find out.</a></h4>\n<p>There are a lot of things to my tech that I could modify to make it more secure or de-Google things, but I want stuff to just work - yeah I could install GrapheneOS on the Pixel I plan on getting, but if something happens it’s on me to troubleshoot instead of getting to pass it off to Google. I know I’m damn well not alone in that aspect, there’s a reason that even among technically minded folks that rooting and custom ROM use has gone down (outside of Google making it harder to do and more annoying to use normal things).</p>\n<p>Like, I want to set up a nice smart home someday. I don’t want shit on WiFi for various reasons (mostly that’s more things cluttering up the network), so I’m stuck with using Zigbee, Z-Wave, or Thread as the backend. The only “smart” things I have are three WiFi bulbs from Yeelight (also known as Xiaomi) that I got a while back because they were cheap and they mostly worked. I don’t really care if I end up replacing them or delegate them to like, a lamp. However, when it comes to Matter-based smart devices (of all flavors, Matter over WiFi or Matter over Thread), not all ecosystems are the same - which <strong>infuriates</strong> me.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying face-down on the ground, with a low battery symbol above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying face-down on the ground, with a low battery symbol above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Apple has relatively expansive support for many Matter devices, and a lot of Matter devices also have extra functions if you use HomeKit too. Google has more limited pool of what works with their Matter system, and the same story applies for Amazon. Samsung’s Smartthings supports everything up to Matter 1.3, as does Home Assistant. I don’t <em>particularly</em> want vendor lock-in, so that leaves me with either Smartthings or Home Assistant.</p>\n<p>This involves a lot of backend tech stuff I get the joy of setting up, which I wouldn’t have to fight as much if I used Smartthings instead, but I’m personally willing to fight <em>some</em> of my future smart-home tech to make things work My Way. Not everyone is, and that’s why I wish Apple, Google, and Amazon all had full support for Matter 1.3 devices (and fully support Matter 1.4 once that version establishes itself). If you don’t know that Samsung is the only system with full Matter support, you might be left in the dark because something that should allegedly work just fine with your Google might not at all anymore.</p>\n<p>The only reason I care to fuck around with Home Assistant for Zigbee and Thread and Matter is that none of those devices are in my home yet. I don’t own a single Zigbee or Thread or Matter smart device sensor whatever yet, which means I have zero switching cost involved. If I had a couple of smart plugs, a couple sensors, a lightbulb or two, maybe a wireless remote button… well, that equation changes things because my setup works just fine like that.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\" alt=\"Senil sprawled on his back, sleeping. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil sprawled on his back, sleeping. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Why throw it all out the window just to put that in my control when it already works? I want to be able to yell at something to turn a light on or off, or have something happen when I leave home, or be able to monitor something from my phone remotely (be it sensor stuff, energy, or a CCTV system). If that shit is in place already… why fuck around trying to “improve” things, leaving me without that system until I get it working again but Differently?</p>\n<h2 id=\"switching-costs-exist-too\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tech-should-just-work/#switching-costs-exist-too\">Switching costs exist, too</a></h2>\n<p>I want everyone - of all stripes, but obviously tech nerds right now - to remember that switching costs exist. People get familiar with an ecosystem, and the more familiar they are - and the more they buy into it - the harder it becomes to convince them to try something else. Even if someone has relatively low switching costs in terms of their ecosystem buy-in, are they technically minded enough or whatever to make that change relatively un-supported?</p>\n<p>Sorry to use you as an example here, fiance, especially since we just talked about this the other day, but you’re a good case study here. I know that the vast majority of their compute needs could be handled by a stable Linux distro that “just works” as much as possible. The only clear exception being games with kernel-level anti-cheat, which is hopefully going away eventually <a href=\"https://www.notebookcheck.net/Microsoft-paves-the-way-for-Linux-gaming-success-with-plan-that-would-kill-kernel-level-anti-cheat.888345.0.html\">since even Microsoft has acknowledged that it’s insecure</a>.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\" alt=\"Senil hugging a big pink heart. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil hugging a big pink heart. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>However, even though Windows is, well, Windows, and not particularly enjoyable to use, Windows is what they’re extremely familiar with. Even though in theory (and in my months of running Aurora on my laptop as my only computer for months now, in practice) they’d have no problem switching away given that everything they run would work fine on Linux, actually doing that is a hassle in its own right. There’s suddenly a whole user interface and experience to get used to, a new set of software paradigms to at least get loosely familiar with, and its own set of quirks to learn as well. All of which would be at best adjacent to Windows, and at worst sizeable departures from what they’re familiar with.</p>\n<p>This is the case for MANY people out there. They don’t care that Linux is free and runs better and is more secure than Windows given, uh, Recall is still a thing. Windows is still <em>what they know</em> - and it makes more sense to get Microsoft to make Windows a more enjoyable experience for those who don’t, or even CAN’T, move to something else. Think of how much enterprise software is Windows only, or <em>maybe</em> Windows and MacOS. You might be able to hack something together to get that software to run on Linux, but now you’re fighting both the software as well as the ability to even launch it in the first place.</p>\n<h2 id=\"live-and-let-live\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tech-should-just-work/#live-and-let-live\">Live and let live</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HuggingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HuggingSenil.png\" alt=\"Senil hugging a generic YCH furry. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil hugging a generic YCH furry. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Shockingly few people outside of tech nerds, privacy advocates, and those around them care much about how secure a platform is, or the end-goal of the platform, or stuff like federation when it comes to ActivityPub software. They want something that works for them, and that they’re familiar with. As I’ve seen folks on Fedi say - and a sentiment I agree with - “The year of the Linux Desktop will come when you can go into Best Buy and buy a laptop with Ubuntu on it for $400.”</p>\n<p>The year that E2EE chats that aren’t controlled by scummy corporations like Meta will come when people use it, and it presents as good an experience as what they’re already used to. The year that there’s even somewhat a return to the old web in structure will come when the onboarding is straightforward, when the software is intuitive, and where things “just work” with each other. People shouldn’t need to open up the original post every time just to see all of the replies their instance didn’t find. People shouldn’t feel threatened to lose their friends every time a defederation happens, or an instance shuts down out of nowhere and they can’t actually move shop.</p>\n<p>A lot of people want folks to stop using Twitter/X, Facebook, Instagram, and similar. But that won’t happen until the alternatives that are <em>on paper</em> better, become, well, actually better, with a user base large enough to make people at least want to say hi cause their friends are there too.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\" alt=\"Senil curled into a ball, crying. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil curled into a ball, crying. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Sorry, Friendica, but talking about how secure you are and what federation is like isn’t going to sway the average person. That’s something only nerds care about or even understand.</p>\n",
      "date_published": "2025-01-12T00:00:00Z"
    },{
      "id": "https://blog.senil.me/gateway-to-network-vs-community/",
      "url": "https://blog.senil.me/gateway-to-network-vs-community/",
      "title": "Gateway to the Fediverse, or have a local community?",
      "content_html": "<p>This post is brought to you by some recent-ish “discourse”? On the fediverse regarding the purpose of instances in the broader fediverse network, in addition to someone’s observation as to the shift from an instance being the gateway to a broader network, into the current view of an instance being a local community that <em>happens</em> to connect to the broader fediverse.</p>\n<p>And I have some Opinions™ on this matter.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"gateways-to-the-network\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/gateway-to-network-vs-community/#gateways-to-the-network\">Gateways to the network</a></h2>\n<p>The general understanding of instances on the fediverse is that they’re gateways to the broader network, managed by moderators and with people that are chill to be around. In my eyes, this is more or less how the vast majority of instances that widely federate to others operate. Block out the obvious bad actors, but prioritize access (even limited) to the broader network unless there is something serious enough to warrant a full instance suspension.</p>\n<p>As a personal view, <em>this is more or less how it should be</em>. There’s arguments to be made as to what the lines are for limiting or suspending remote instances or users, but those are highly dependent on instance admins and their moderation policies. I have zero thoughts onto where those lines are, outside of “keep the bad actors out and monitor for those who show signs of it.” That’s pretty much all I have on what those bounds are.</p>\n<p>As an aside, <em>should</em> I ever self-host a fediverse instance for others, this will more or less be the stance I take. A gateway to the fediverse at large, with a moderation team people already know and trust, since this would be spun off from an existing group that’s been on Discord for years now. I’d take the initial precautions - suspending well-known Nazi instances and the like, and avoiding limiting any others until we’re more established and have a bit of a reach where limiting a whole instance becomes a question.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\" alt=\"Senil hugging a big pink heart. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil hugging a big pink heart. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"local-community-to-the-network\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/gateway-to-network-vs-community/#local-community-to-the-network\">Local community (to the network)</a></h2>\n<p>“Instances as a community” is the other take that was mentioned in the post that inspired my own version of it, and is the one that I personally dislike. I think it’s totally fine for an instance to be focused around one aspect, or more targeted towards certain user groups (meow.social being a large furry instance, tech.lgbt being intended for queer techies, mastodon.art being the huge art instance, etc.), however it <em>can</em> become a problem when it’s community first, gateway second.</p>\n<p>The “community first, gateway second” approach is <em>totally</em> fine in my eyes - there is absolutely nothing inherently wrong with it. The problem - in my eyes - is when such an instance claims to be a gateway to the network, but is also clearly trying to be its own community. There are some instances that are meant to be this way from the start, suspending a ton of instances from the get-go. This leads to them effectively operating as an allowlist instance, where only select instances are allowed to talk to that one.</p>\n<p>There’s nothing wrong with it - so long that it’s set up that way from the get-go or early on, and hopefully is communicated and advertised as such to members. Instances that initially work via denylists (aka the default behavior for fediverse instances) suddenly trying to change to an allowlist format creates problems.</p>\n<h2 id=\"breaking-social-links\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/gateway-to-network-vs-community/#breaking-social-links\">Breaking social links</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>The major, number one problem when it comes to outright suspending an instance is the matter of severing follows and whatnot between the two. Mutuals on the other instance will suddenly disappear to the aether if the whole instance is suspended, and herein lies the ultimate concern. A major instance defederating from another major instance is bound to break dozens, if not hundreds or even <em>thousands</em> of social links between the two, and even if that suspension is reversed, it’s very difficult to get those links back.</p>\n<p>This was seen firsthand when mastodon.art (dotArt henceforth) was suspending instances for unclear reasons when “The Bad Space” was <em>the</em> source of fediverse meta and drama last year - I do not know enough of what all was happening at the time, nor do I have the willpower to find out, so all I will mention is it caused a huge uproar across large swaths of the fediverse, and in my opinion ended up <em>damaging</em> the image of fedi as a whole.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>The lead admin of dotArt, having close ties to various other instances, started defederating <em>entire instances</em> for unclear reasons, on occasion based on the actions of a handful of members or admins during a chaotic and stressful time as everyone is collectively figuring out what the hell is going on, what to make of it, and how to move forward from here. dotArt is a <em>huge</em> instance, with roughly 4800 active users as of me making this post (this is nothing compared to the flagship instance, mastodon.social, with a whopping 280000 active users, though).</p>\n<p>This, of course, leaves out the many, many users who aren’t super active but still post on occasion - especially back in 2023 when the lead admin of dotArt was defederating large instances for the actions of a few.</p>\n<p>For hopefully obvious reasons, this meant a lot of artists and creatives who posted on dotArt, who had a long history of working on dotArt, suddenly lost out on tons of potential clients for commissions, project work, freelancing, etc. All because their instance’s admin defederated from many instances - the worst part is those who had clients on those suspended instances suddenly lost contact with them if they only communicated via the fediverse, and those clients could never see the artist’s works without going to their page manually.</p>\n<p>Slight aside: This happening is one of the key faults with the federated structure as a whole - all it takes is one person (or a small handful of people) to cut off instances from the entire network. Be it by mass blocking others for no clear reason, or by giving up because they can’t deal with the myriad stressors of being an admin and quickly pulling the plug on their server. This is something that fundamentally can’t happen on a much more centralized network, barring gigantic blocklists <em>claiming</em> to filter bad actors actually containing a fuck ton of normal people too.</p>\n<h2 id=\"the-fault-of-gateway-first\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/gateway-to-network-vs-community/#the-fault-of-gateway-first\">The fault of gateway-first</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying face-down on the ground, with a low battery symbol above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying face-down on the ground, with a low battery symbol above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>The risk of breaking social links under a “local community first” approach (which could be very trigger-happy with suspensions) doesn’t magically mean that a “gateway to the network” approach is perfect and ideal and has no problems whatsoever. This approach has its own flaws. The biggest of which, in my eyes, is that moderation is <em>extremely</em> reactive. Because of this priority, any infraction of standards that other instances are held to is harder to evaluate.</p>\n<p>Does instance size matter? What about the severity of the infraction? Is it one member or dozens? Is it a moderator or the lead admin doing this? Is that instance even well moderated, or is this just a momentary lapse in mod activity for some reason? All of these factors <em>and many more</em> could play a role into making these kinds of decisions. When acting as a “gateway first” instance, initial actions set precedence for the future.</p>\n<p>Instances should be held to the same set of standards, after all. It’s ridiculous to set one decision early on for one instance, and then months later make a different decision for a different instance that otherwise meets the exact same criteria as the former one. The way to manage this is to keep a somewhat detailed log of actions, in perhaps a “burn book” of sorts, in order to provide easy-to-access historical logs of transgressions.</p>\n<p>The “burn book” could also be used for member-level infractions as well, local and remote, since suspending a single user (or a handful on a thousand plus member instance) might be an easier to justify decision than an entire instance.</p>\n<h2 id=\"transparency-matters-regardless-of-approach\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/gateway-to-network-vs-community/#transparency-matters-regardless-of-approach\">Transparency matters regardless of approach</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\" alt=\"Senil pointing towards the viewier, winking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil pointing towards the viewier, winking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>The thing that spurred the post that I’m even responding too is ultimately due to a massive lapse in transparency in an instance’s actions. I will not comment on exactly why there was no communication when another instance was suspended - for very good reasons once that information came to light - but all I can say is that <em>something should have been said</em>. Given the severity of the now-suspended instance admin’s behavior, it absolutely should have been suspended, even if it was just the admin.</p>\n<p>However, there was no transparency in the matter. It took people questioning why links to the other instance disappeared for suspicion to be raised, up until the admin of the now-suspended instance made a long post talking about what happened, then explaining why the now-suspended instance was, well, getting suspended by others. I want to stress, <strong>it is a very good thing this instance was suspended.</strong> The admin admitted to being a pedophile, to keep things concise, though it isn’t quite as straightforward as just that (mental health stuff played a role too, but we’re getting into weeds that distract from my point).</p>\n<p>The problem is that <em>nobody knew what the hell was going on.</em></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\" alt=\"Senil curled into a ball, crying. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil curled into a ball, crying. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>This led to some uproar over the actions of the instance that didn’t reveal anything at all when they acted, frustration over further decisions from that instance’s admin team (which were 100% breaches of trust, but again distracting from the point), as well as a lot of calls to mass-suspend that instance over a lack of transparency. There were other matters brought up as well, however I personally saw zero direct evidence providing a basis for historical actions, with the only immediate one being “hey, you really broke trust here and that is Not Okay for an admin to do.”</p>\n<p>That isn’t to say that it doesn’t exist, but it’s hard for me - a user who <em>might</em> become an instance admin himself - to trust that this is coming from a well-intentioned place instead of just lashing out. I did end up unfollowing and muting some who were causing this, largely because I just had no reason to believe their claims.</p>\n<p>(The one that spurred that unfollow spree was someone who subscribed to the “local community first” approach, so that likely played a role in the actions, but that’s me trying to prescribe meaning onto someone else’s actions which is meaningless)</p>\n<h2 id=\"what-now\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/gateway-to-network-vs-community/#what-now\">What now?</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\" alt=\"Senil sprawled on his back, sleeping. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil sprawled on his back, sleeping. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Well, I don’t really have anything regarding “a way forward.” The only thing I have to say is that the “local community first” approach doesn’t <em>feel</em> like a true social media to most folks. Social media, is, well, social. It’s a way to see what folks all over are doing, in addition to your good friends. There are existing places folks can exist in localized communities - however much I hate to say Discord and Telegram are big places for that, those are big places for that. Those spaces can’t act as a gateway to other places, but they <em>are</em> still local communities</p>\n<p>Trying to turn a federated instance into that - while still claiming to be part of the whole network - betrays the point of federating and encouraging folks to follow people on other instances.</p>\n<p>It’s difficult to follow hashtags and find folks from your circles if the people you follow can’t really share much from outside <em>their</em> sphere, either. There are some folks on the fediverse that I found by happenstance, but that’s because I’m on an instance that seems to take the “gateway first” approach that I personally appreciate. Even if it means it’s more involved moderation-wise when it comes to decision making, it makes my time on the fediverse feel much more open.</p>\n<p>I suppose this is also why I’ve kind of fallen out with tumblr. I really don’t see many folks from outside my immediate circle and the folks in their circles. I have to actively hunt new folks down there, and I just don’t have to do that as much on other sites. I’ve found artists who I never would have found otherwise. I’ve found folks who I’d at least consider loose friends right now. I’ve found others who I’d DEFINITELY consider very good friends.</p>\n<p>I just… don’t think I could ever get that from a <em>supposed social network</em> that fixates on local community first and foremost. But that’s also just me. I’m not you, my preferences aren’t yours. Maybe you love that approach. If you do, I’m somewhat surprised you’ve read this far. Have a hug, if you want.</p>\n<h2 id=\"last-minute-addendum-fedi-v-bluesky-fight\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/gateway-to-network-vs-community/#last-minute-addendum-fedi-v-bluesky-fight\">Last-minute addendum: Fedi v. Bluesky - FIGHT!</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>I’ve seen talk as of late where folks lament over people going to Bluesky instead of the Fediverse at large, and I see <em>way</em> too many folks gripe over the fact that Bluesky is venture capital funded, or that it’s controlled by one big company, or that it’s protocol is built in a way where it’s basically impossible for individual collectives to run, but a lot of y’all forget a crucial thing.</p>\n<p>People don’t care about those things - they want something that works <em>for them</em>. And while the Fediverse works for many - I mean, I’m here - it just doesn’t work for many, MANY others. Either culturally (y’all need to get rid of the “I won’t boost without alt text” attitude and ADD ALT TEXT TO REPLIES, same with wanting eye contact and food always CW’d), logistically (finding The Right Instance can be a pain, and also fuck you if you need a long-term presence on the network since you can’t truly pick up shop and move between instances), and technically (federation is great but there are so many quirks to it that are a hurdle to many. See: how often you have to open a post on the original instance to get the full context of a reply chain).</p>\n<p><em>I</em> am one of the people who really doesn’t care about the underlying protocol, the technical aspects (too much), or anything else that “makes federation better.” I want something that feels right, that lets me hang out online, and just have a good time. I will still be here on the Fediverse - I still think the project has merit. But the culture here <em>has</em> to change for people to want to both come here <em>and</em> choose to stay here long-term, and make this corner of the net their primary space to be.</p>\n<p>Otherwise, the Fediverse will forever be niche, closed off, and everyone here will continue to lament that nobody comes here and keeps going for The Big Network™, despite the eventual enshittification that <em>may or may not</em> happen to The Big Network™.</p>\n",
      "date_published": "2024-12-09T00:00:00Z"
    },{
      "id": "https://blog.senil.me/some-more-energy-thoughs/",
      "url": "https://blog.senil.me/some-more-energy-thoughs/",
      "title": "Just some more energy thoughts.",
      "content_html": "<p>This is a <em>slight</em> continuation of my very long post on <a href=\"https://blog.senil.me/what-negative-energy-prices-really-mean\">“What negative energy prices really mean”</a>. I want to talk more about my stance on rooftop solar (either residential or commercial), electrification as a whole, and such.</p>\n<p>There was originally a whole bit about power factor and whatnot, since I did briefly mention it there, however I can’t distill it into an easy to understand formate just yet, so it’s being left off for later. Anyways, let’s get on with it since this is already disjoint.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\" alt=\"Senil pointing towards the viewier, winking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil pointing towards the viewier, winking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"solar-and-battery-banks\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/some-more-energy-thoughs/#solar-and-battery-banks\">Solar and battery banks</a></h2>\n<p>It’s totally possible to add battery banks to existing solar plants, there isn’t a significant reason to not do so, and it’s something we need to be doing as soon as possible to help make solar more controllable and thus viable. This is also why I think any form of rooftop solar needs to be accompanied by battery banks. Even if a utility pulls excess power from your battery bank (something that would be <em>really neat</em> to somehow implement, again with my idea of stuff having some percentage of excess “invisible” capacity that never matters to the end user), it’s still a controllable amount of power that they can pull.</p>\n<p>I personally plan on installing rooftop solar with battery banks someday, primarily to enable any self-hosted equipment to continue to operate in the event of a blackout (even if it’s just to safely backup locally and shut down to help conserve overall power), but also to cut down on the costs of running powerful equipment if I ever need that kind of raw compute strength. <a href=\"https://newegg.io/cad80e7\">I’ve specced out a very powerful home NAS system</a> that is 100% excessive and I will almost certainly never build, and at that point it’d make more sense to build a full-on server rack with more modular components, but it’d be really fun anyways.</p>\n<p>Having a battery bank on-site would also be helpful since it means I don’t risk back-feeding power to the grid unless the utility wants me to. All rooftop solar systems, or even generators for any building, need a disconnect switch from the distrubition system to prevent backfeeding power to the grid. This is for safety reasons, to protect lineworkers while they make repairs. The last thing they need is to be working on live lines that they don’t expect, which could cause serious harm to them or the equipment they work with.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"expanding-electrification\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/some-more-energy-thoughs/#expanding-electrification\">Expanding electrification</a></h2>\n<p>As we shift away from natural gas and fossil fuels in general, the grid is going to need to keep up with the rapid pace of electrification. This does present some serious problems, since it takes more time to upgrade the grid, add generation facilities, improve transmission lines, substations, etc. than it takes for homes to become electric-only and ditch natural gas or propane. This is why I think we need to focus on cutting back on how much power is needed at all.</p>\n<p>Well, how do we go about doing that?</p>\n<h3 id=\"insulation-and-heat-pumps\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/some-more-energy-thoughs/#insulation-and-heat-pumps\">Insulation and heat pumps</a></h3>\n<p>The biggest problem, when it comes to buildings, is <em>insulation</em>. A poorly insulated building is going to let more heat in or out compared to a well insulated building, it’s just a factor of the physics around heat transfer. Every problem when it comes to heating and cooling buildings of any size is made much easier when they’re better insulated, and require less effort to heat and cool. Literally nothing else matters if buildings are poorly insulated, even if a home doesn’t electrify their heating. A gas-fired central furnace will need to be sized larger and/or run for longer than a home that’s much better insulated.</p>\n<p>Outside of insulation, this is where heat pumps come in. Electric resistive heat is 100% efficient - every watt that goes in is a watt of heat shoved out in some way, shape, or form. Transmission, however, is <em>not</em> 100% efficient, let alone power generation itself. Heat pumps are miracles of refrigeration, and they aren’t even new. Air conditions <em>are heat pumps</em>. Your fridge is a heat pump. We use heat pumps regularly, but we haven’t started using them for, like, heating until very recently. They can move upwards of four times the energy it takes to run them, which can easily beat out electric resistive heating, and usually beats out natural gas heat. Plus, you know, they also cool your home in the hot spring and summer months.</p>\n<p>And also the whole dehumidication thing, that’s a nice bonus in some places.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/LaughingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/LaughingSenil.png\" alt=\"Senil laughing on the floor. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil laughing on the floor. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Heat pumps in general only out-perform a condensing gas-fired furnace (it just absorbs more energy from the created water vapor that’s otherwise wasted) if their coefficient of performance - the measure of how much heat energy they transfer compared to the power they draw - exceeds something in the neighborhood of 2.4, or 240% of their input power. Otherwise, it loses out to natural gas due to transmission losses and such, especially compared to how efficient higher-end furnaces get.</p>\n<p>On a wildly different note…</p>\n<h3 id=\"ev-s-and-public-transit\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/some-more-energy-thoughs/#ev-s-and-public-transit\">EV’s and public transit</a></h3>\n<p>A big problem I take with EV’s as presented in the United States specifically is that they’re being treated as the exact same as gas and diesel powered cars. The idea is that everyone just replaces their fossil fuel powered cars with an EV and we call it a day. This… is a big problem. When it comes to the local problems, it’s adding a sudden burst of electric load to the grid that may or may not be able to handle it.</p>\n<p>There also, of course, the problem of mining the materials in the first place. Mining is destructive, and we still only have so much raw material to build batteries - battery recycling helps, but if everyone is driving an EV with 60+ kilowatt-hour batteries, it’s still a huge amount of raw material to mine in short order. Those batteries still need to be replaced over time, as well, and batteries make up the BULK cost of an EV, to where it almost makes more sense to <em>buy a new one</em> (even a gently used one) than to pay for a totally new battery. Especially in a day and age where EVs are improving at a breakneck pace.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Due to this rapid development of EV personal vehicles, I just can’t really recommend them being <em>the</em> way of transit. Let alone the fact that all it does is trade one problem for another, while avoiding the problem of “one more lane” and constantly new road infrastructure that’s needed to support more and more vehicles on the roads and highways. The solution to that is public transit, to nobody’s surprise.</p>\n<p>Even a battery-powered bus can transport way more people than the equivalent number of EV’s, plus an aged battery could be straight-up used for general battery backup storage with some re-design efforts from the existing cells. Light rail, trolleys, and even commuter rail would massively benefit from being electrified. Any form of long-distance rail - medium or high-speed - needs to be electrified as well in some way, shape, or form. Most engines are diesel electric hybrids, which is a start, but full electrification of passenger trains would be <em>huge</em>, and be a massive improvement from everyone just owning EV’s and having thousands and thousands of fast-charging stations dotting highways nationwide.</p>\n<h2 id=\"closing-off\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/some-more-energy-thoughs/#closing-off\">Closing off</a></h2>\n<p>The moral of the story is… well, there isn’t one. I don’t really have a neat and tidy way to clean this up since it’s a disjoint ramble about some stuff that should make electrification easier, as well as what I plan on personally doing should I have the money to both own a home, and make those kinds of upgrades. I just needed to get this off my chest and into one addendum piece so it’s all in one place and I can hopefully just reference to this later down the line.</p>\n<p>Thanks for reading this far, I guess.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\" alt=\"Senil flexing his biceps, smirking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil flexing his biceps, smirking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>",
      "date_published": "2024-12-04T00:00:00Z"
    },{
      "id": "https://blog.senil.me/what-negative-energy-prices-really-mean/",
      "url": "https://blog.senil.me/what-negative-energy-prices-really-mean/",
      "title": "Negative energy prices don&#39;t mean what you might think.",
      "content_html": "<p>I am begging people to understand this, because this is very important and yet I feel like few people actually understand the actual truth behind “negative energy prices”. Contrary to what I see some folks (typically leftists and liberals) think, it has very little to do with capitalists being annoyed that they can’t make money. It has everything to do with how power is generated, supplied, stored, and consumed.</p>\n<p>Okay, maybe still a little bit of capitalists being angry they can’t make money, but it’s still not for the reasons you might expect.</p>\n<p>The TL;DR is that “negative energy prices” mean that supply far outstrips demand, there is no way to store the excess power, and utilities have to <strong>pay</strong> clients - typically industrial - to spin everything they have up to full power to intentionally waste the excess energy so the demand meets the supply. Yes, waste excess energy, I am not joking.</p>\n<p>If you want, <a href=\"https://blog.senil.me/what-negative-energy-prices-really-mean/#storing-energy-for-later\">you can jump to where I talk about storing energy, the ways we can do it, and the future I hope unfolds.</a>. Otherwise, keep reading to learn what “negative energy prices” actually mean.</p>\n<p><strong>Addition</strong>: <a href=\"https://blog.senil.me/some-more-energy-thoughs/\">I’ve also added some extra thoughts on energy</a> that would’ve made this post even longer, and they’re only tangentionally related at best anyways. They don’t change anything here, it’s just bonus content.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\" alt=\"Senil pointing towards the viewier, winking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil pointing towards the viewier, winking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"power-generation-consumption-and-grid-frequency\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/what-negative-energy-prices-really-mean/#power-generation-consumption-and-grid-frequency\">Power generation, consumption, and grid frequency</a></h2>\n<p>Both power supply and power demand tie into the fundamental required constant of the power grid - the frequency it operates at. In North America we use a 60Hz frequency, while Europe uses 50Hz. Various other regions use one frequency or the other, but the important thing is that frequency has to remain as constant as possible. Grid frequency gets measured to the thousandth of a Hertz in order to closely monitor grid behavior, and the power supply vs. power demand ratio determines how the frequency fluctuates.</p>\n<p>An excess of power supply starts to bump up the frequency, while an excess of power demand decreases it. There <em>are</em> additional considerations such as the power factor - which is more or less a measure of how “efficient” your power transmission, distribution, and consumption is, but that’s getting into detail that isn’t relevant to “negative energy prices”. The grid is surprisingly stable, but letting the frequency drift too far away from the nominal frequency of the grid can and will cause problems. Under-frequency (demand outstripping supply) can cause a wide-scale blackout if generators cannot keep up with the load in time, while over-frequency (supply outstripping demand) forces generation to shut off ASAP, something that’s difficult for certain types of plants.</p>\n<p>Solar facilities and wind farms can adjust their output relatively quickly, <em>however</em> it still has to be carefully timed to prevent an over-adjustment that’ll cause a serious under-frequency event, which risks that wide-scale blackout problem. And in the event that a utility (or transmission company) <em>can’t</em> shut power off fast enough, they’re going to need to call up every resource they have to purposely waste power.</p>\n<p><em>Wasting</em> power is where the problem lies. There is no way around it, in a situation severe enough to cause “negative energy prices”, load-shedding has to happen as soon as possible to prevent problems while generation properly adjusts.</p>\n<p>There’s just one problem, though. Solar facilities are very sporadic in their output power.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"the-unfortunate-problem-of-solar\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/what-negative-energy-prices-really-mean/#the-unfortunate-problem-of-solar\">The unfortunate problem of solar</a></h2>\n<p>Solar power is <em>great</em>, especially as we get more efficient panels that can handle extreme heat better. But you have to pair solar power with some form of energy storage to help offset that sporadic generation - otherwise you run into a situation that California has dealt with, where they encouraged so many people to install rooftop solar (since rooftop solar alone is much cheaper than fossil fuels) <strong>but</strong> they neglected to set up the proper energy storage capacity to handle the fluctuations in power output. Solar facilities paired with quality battery storage - long-life batteries with high capacity promises even after a decade or two - are actually <em>more</em> expensive compared to a fossil fuel plant.</p>\n<p>(aside: that doesn’t mean we shouldn’t install them, but it’s a factor to keep in mind)</p>\n<p>And, well, because they had no way to store all of that excess energy, utilities had to beg their industrial clients to spin up all of the motors, ovens, etc. that they could in order to waste that extra power. Power that they would normally be charged for, but because the utility is desperate to load shed beyond their normal capacity (utilities have some load shedding systems of their own), they generally have no choice but to <em>at minimum</em> pay for the cost of energy delivered to the clients they beg to waste power.</p>\n<p><em><strong>That</strong></em> is what a “negative energy price” means. It means being forced to waste power because, for some reason or other, you’re generating way too much power and can’t get rid of it fast enough. On a per kilowatt basis, power is being generated way faster than you can get rid of it. The power grid <em>cannot</em> store power, power has to go somewhere. Trying to shove too much power onto the grid will result in that power finding its way back to where it was generated, since power has to make a complete loop somehow.</p>\n<p>Power doing that in an uncontrolled manner means faults happening on transmission or distribution lines, transformers blowing up because they’re being pushed well outside of their rated boundaries, substations going down, or generators potentially breaking because they’re getting pushed too hard - <em>everything</em> runs at the grid’s frequency whether you like it or not, and not everything is going to be built to handle an excessive over-frequency event. Stuff can - and probably will - break.</p>\n<p>It’s very expensive to fix these things. It takes time. It means large-scale blackouts if we can’t fix it.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"how-to-regulate-generation\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/what-negative-energy-prices-really-mean/#how-to-regulate-generation\">How to regulate generation</a></h2>\n<p>Not all forms of power generation can be quickly regulated and changed to new outputs. Nuclear is by far the easiest example of this - it’s a great source of base-load power, but it’s a pain in the ass to get it to some new power level. It takes a long time to increase or decrease a nuclear plant’s output because, well, you’re increasing or decreasing the heat generated by the radioactive material, and you <em>do not</em> want to even think of causing a meltdown by acting too fast.</p>\n<p>Natural gas plants are able to change very, very quickly - just cut off the gas supply to certain turbine setups, or decrease the amount flowing in to cut back on the heat generated, slowing the boiling of water and thus the speed the turbines can move at. Wind and solar can also change very quickly, but by nature their output is less predictable. Sometimes you can have a good idea as to how much power they’ll make, othertimes you just have to hope you’re right and can spin things up or down fast enough to compensate.</p>\n<p>For hopefully obvious reasons, the quickest way to guarantee power gets changed quickly is via natural gas facilities. But we <em>need</em> to phase them out as fast as possible across the world in order to cut down on greenhouse gas emissions - plus, y’know, we don’t have infinite natural gas. So solar and wind renewables end up taking their place. But that means needing to install some sort of energy storage, either on-site or at dedicated facilities, in order to regulate their power output to better match the demand needed of them.</p>\n<p>So… how can we do that?</p>\n<h2 id=\"storing-energy-for-later\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/what-negative-energy-prices-really-mean/#storing-energy-for-later\">Storing energy for later</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying face-down on the ground, with a low battery symbol above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying face-down on the ground, with a low battery symbol above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h3 id=\"batteries\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/what-negative-energy-prices-really-mean/#batteries\">Batteries</a></h3>\n<p>There’s the immediately obvious solution to storing energy - just install batteries, silly! And you’re right, standard batteries are a <em>great</em> way to store energy. However, pretty much everything on the power grid is expected to last decades, so whatever battery system you use needs to be able to retain the vast majority of its capacity after at least a decade, preferably even longer. Fortunately, there are new battery chemistries that are available today, or will be available soon, that are substantially more stable and handle charge/discharge cycles better than older chemistries.</p>\n<p>The current hotness when it comes to stable batteries with long shelf lives are lithium-iron phosphate, usually just referred to as LiFePo. They currently have a worse energy density compared to traditional lithium-ion polymer (usually referred to as LiPo), however they trade that raw energy density for a much better “shelf life” in a way, with 80% capacities quoted after ten years. It’s still a new chemistry, so we’ll have to wait and see if that claim holds true in the real world. Oh, and LiFePo batteries generally don’t need materials such as cobalt, which is difficult to source anywhere outside of the Congo, and cobalt is… not a conflict-free material, with mining of it being extremely manual labor intensive on the locals. Expect LiFePo to show up more in large packs, such as EV’s, too.</p>\n<p>There also exist a variety of <em>sodium-ion</em> batteries, too, that are gaining interest. To my knowledge they aren’t remotely as common as lithium-based batteries, but their properties are similar enough to lithium-based chemistries. The use of rechargeable sodium-based chemistries is extremely recent, however we’ll likely see it proliferate over time, too.</p>\n<h3 id=\"pumped-hydro\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/what-negative-energy-prices-really-mean/#pumped-hydro\">Pumped Hydro</a></h3>\n<p>But batteries aren’t the only way to store energy. We can store energy in the form of gravitational potential by holding some material of some kind higher than some other location. Well, that’s energy we could store by pushing something higher up, and get back by letting it fall down and spin a turbine in some form. The way we currently know how to do - and have done for well over a century know - is pumped hydro.</p>\n<p>The idea is relatively straightforward, though difficult to implement. Find two conveniently placed lakes, and set up a hydro facility at the lower one, running the usual tubes and piping from top to bottom. This way, you can generate power by “pulling” water from the higher lake, using its potential energy to convert into electrical energy from its kinetic energy going past the hydro turbines. A pumped hydro facility will <em>usually</em> do this during the day, selling power when it’s needed more. And then, when power demand is lower, a pumped hydro facility will then buy power back in order to shove water from the lower lake back up to the higher lake for future use the next day.</p>\n<p>This system is remarkably simple and effective - it’s more or less a glorified hydro plant, just with the need to set up a way to push the water back up the hill. While I have no experience with a pumped hydro plant, one way you <em>might</em> be able to accomplish the “pump water back up the hill” would be to use the very same generators used when the water flows downhill, which is possible because of one neat trick. Generators and motors are the exact same thing, just wired the other way around.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>If you could change the wiring on the fly (letting the generator safely stop before doing becoming a motor, and vice versa), you could theoretically use that generator to push water back up to the higher lake. The generator-slash-motor would need to be powerful enough to accomplish such a feat, so it’s probably more realistic to just have a separate pump system. It’d cost more, but it also means you don’t need to spend more on a generator that’ll be strong enough when used as a motor, let alone install it in the right place.</p>\n<p>Pumped hydro does have a fundamental flaw, though, and one you might have figured out by now. You need convienient locations to install such a system. Two lakes that are large enough, with enough of a height difference to give a substantial amount of potential energy, and close enough to minimize material costs. Sure, you <em>could</em> terraform to create artifical lakes to do this, but that’s pretty damn expensive just to use pumped hydro instead of batteries.</p>\n<h3 id=\"that-weird-crane-thing\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/what-negative-energy-prices-really-mean/#that-weird-crane-thing\">That weird crane thing</a></h3>\n<p>There’s been an idea for years now that works effectively the same as pumped hydro - lift some stuff up high enough to store substantial potential energy when power is cheap, and carefully lower them down to spin a generator when power is needed. These designs typically work by lifting and stacking concrete blocks, but there’s some flaws with this system in my eyes.</p>\n<p>First of which being that you lose out on potential energy if you can’t stack enough blocks safely. You only get the maximum potential energy when you can stack multiple blocks at the highest defined limit, while pumped hydro gives roughly the same potential energy throughout. There’s also of course the risk of breaking the concrete blocks, either from the crane being too rough with them, a storm potentially knocking the higher-up ones down, or the blocks just wearing down with time.</p>\n<p>As far as I’m aware, this idea hasn’t actually been installed in the field, only tested by various researchers and companies to determine viability. With battery banks becoming cheaper over time, I personally don’t see this weird crane idea coming to fruition and being installed grid-scale just to avoid batteries. To me, it feels far too risky and with not enough reward compared to any pumped hydro facility, let alone a dedicated battery facility.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\" alt=\"Senil curled into a ball, crying. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil curled into a ball, crying. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"where-does-this-leave-us\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/what-negative-energy-prices-really-mean/#where-does-this-leave-us\">Where does this leave us?</a></h2>\n<p>Ultimately, the inabilty to store enough energy causes problems with the grid. We cannot just install renewables without considering this factor, unless we collectively accept that wasting potentially tons of excess energy is worth the effort to install a ton of solar without any way to store power (even on-site). This inability is part of why I dislike rooftop solar if it’s not paired with an on-site battery system, because unless the solar panels are prevented from feeding power to the grid, utilities have this extra generation that they might not know what to do with.</p>\n<p>One individual home isn’t going to make much of a difference, but thousands of homes with a couple kilowatts of solar panels starts to become a problem.</p>\n<p>I want us to learn from the past and prepare for the future. Electrification is only going to continue, and we should prioritize minimizing our need for electricity in the first place too. Installing heat pumps to move more energy than it takes to run them. Building out quality electric-powered public transit in urban areas that cuts down on the need for EV’s in urban areas in the first place.</p>\n<p>And I want folks to read past the god-damn headlines, read the articles and studies, and not make wild conclusions without knowing what the hell they’re talking about. Hell, most of this is me shooting from the hip too, I don’t expect you to believe me or trust my input. I just hope some folks take something away from this long as hell post.</p>\n",
      "date_published": "2024-11-24T00:00:00Z"
    },{
      "id": "https://blog.senil.me/my-time-with-iceshrimp/",
      "url": "https://blog.senil.me/my-time-with-iceshrimp/",
      "title": "My experience with Iceshrimp.JS",
      "content_html": "<p>Earlier this year - technically late last year into early this year, I was trialing the fediverse software known as <a href=\"https://iceshrimp.dev/iceshrimp/iceshrimp\">Iceshrimp</a>, lovingly marketed as “YAMF - Yet Another Misskey Fork”, because it is (there’s a joke that there’s new Misskey forks every week). They’re actually in the middle of re-writing Iceshrimp to use dotNET instead of Javascript, which will hopefully boost performance down the line. Though, Iceshrimp dotNET was nowhere near “production” stable when I tried it, but I want to give it a go once it gets more polished.</p>\n<h2 id=\"what-i-loved-about-it\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#what-i-loved-about-it\">What I loved about it</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\" alt=\"Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>I know people rag on Misskey being bloated, and yeah there’s definitely a ton of features I didn’t care for, or felt were too similar to each other to make it clear what each was used for - let alone some features don’t even <em>federate</em> outside of the server, and this was just for me so they were 100% pointless. But Iceshrimp has a <em>lot</em> of nice quality-of-life features that I made use of.</p>\n<h3 id=\"the-drive-system\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#the-drive-system\">The drive system</a></h3>\n<p>Instead of uploading images, videos, audio, etc. every single time you share something - say, you share furry stickers now and then because they’re fun and personalized reaction images in a way - everything gets uploaded to a user drive that you have full access to, and you share files via that system instead. I mostly appreciated this for alt-text purposes, since I no longer had to remember to add alt-text every single time I wanted to use a sticker, and could make sure that stuff was captioned in similar ways for consistency. Before I pulled that VPS offline (finally), I would regularly refer back to the files in Iceshrimp whenever I uploaded a sticker.</p>\n<p><em>(aside: I’ve literally created a file in the source for this site that solely acts as a way to track the captions for the stickers I use, so that way I can keep them consistent post-to-post and not have to dig through blog posts to find where I used one.)</em></p>\n<p>I wish I could embed alt-text into image, video, etc. metadata so that way I could upload something anywhere and it’d always have the alt-text set up on the service itself, instead of me having to remember every time how to caption it.</p>\n<p>Another thing I like about the drive system? It makes sizing S3 buckets for user-uploaded media straightforward. You can expect to pay for, at most, roughly some amount of money per amount of users at maximum - assuming everyone’s drives are totally filled up. Of course, you’ll probably never hit that amount, but it’s a convenient way to budget storage space and whatnot. When I was looking as using DigitalOcean Spaces, and a 5GB drive size, that comes out to about fifty users per 250GB slice Spaces offers - a neat $5 a month, outbound traffic partly included.</p>\n<h3 id=\"the-bubble-timeline\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#the-bubble-timeline\">The bubble timeline</a></h3>\n<p>This might be something Mastodon, Pleroma, Akkoma, etc. support, but I know for fact Iceshrimp (and Sharkey, maybe other Misskey forks too) have what’s called the “bubble” timeline. This is like the full federated timeline, but only to specific instances that the admins deem “worth” putting into a special timeline. I think this is SUPER handy when it comes to an instance that federates very broadly - giving users a lil selection of known safe instances is a nice touch.</p>\n<p>I think it’s a clever way to shrink down the mess that would be the firehose federated timeline into a normal hose of curated instances.</p>\n<h3 id=\"baked-in-translation-hookups\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#baked-in-translation-hookups\">Baked-in translation hookups</a></h3>\n<p>Being able to read posts made by people speaking in their native tongue is, to me, important. No translation service is perfect, but it’s very nice to at least be able to see what’s being talked about. Iceshrimp includs support for two translation services that link up <em>directly</em> to Iceshrimp (unlike Bluesky right now, which just shoves you to a Google Translate webpage) - LibreTranslate and DeepL. <a href=\"https://libretranslate.com/\">LibreTranslate</a> is open source under GNU A-GPL 3.0, and - importantly to me - <em>can be self-hosted</em>, which means no paying API costs to some other company, or figuring out some way to bypass the costs. <a href=\"https://www.deepl.com/\">DeepL</a> is commercial and costs money once you go beyond 500,000 characters a month, but it has better language support, and translation isn’t dependent on whatever runs your self-hosted setup working, too.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\" alt=\"Senil happily tossing confetti in the air. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil happily tossing confetti in the air. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Ultimately, though, I just appreciated being able to hit a button and see a post translated from one language into mine <em>mostly</em> intact, given the inherent limits of machine translation. Plus, it pretty much always worked compared to X’s Google Translate API, which would occasionaly go “nope, can’t translate this!” even though it’s CLEARLY not in English - and I imagine that happened for folks who speak anything but English and tried to translate from English, too. Mastodon currently only supports DeepL - which is better than <em>no translation option at all</em> - but I don’t know how many instances bother with hooking it up.</p>\n<p>And since DeepL has the whole “you might have to pay at some point” risk for instance admins and operators, I wouldn’t be surprised if the lack of baked-in DeepL translation continues.</p>\n<h3 id=\"quote-posts-and-reactions\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#quote-posts-and-reactions\">Quote posts AND reactions!</a></h3>\n<p>Quote posts are a sticking point on the fediverse, for a variety of reasons, but chief among them is that quote posts could enable harassment and targeting of users by enabling folks to easily dunk on The Main Character Of Today. Folks can still do this, though, by just copying a link and pasting it into their post, which (in my eyes) is actually <em>worse</em> because it means you have no way of knowing how folks on other instances are responding to you. Potentially making it harder to retroactively protect a user from getting harassed because people are coordinating on a separate instance.</p>\n<p>But a built-in quote system, <em>to me</em>, is perfect. Both because “quoting posts is part of making something that Feels Like Twitter but Fediverse”, but also because it makes it easier to respond to a post in a tangential manner. I’ve done this a few times with my fake quotes that link back to the original post, but having a “native” solution makes it much easier to work with. Also, folks will quote posts with a content warning if the original post doesn’t have one that they think it should have, and “make it easy to do this process” makes it easier for folks to do that. Iceshrimp - really, most fediverse software EXCEPT for Mastodon - support quote posts in some form or another.</p>\n<p>Reactions are just fun because they’re a fun way to respond to posts - instead of just liking something, you can send a reaction that might better convey your response, instead of replying with a single emoji. They still show up <em>as</em> likes/favorites on your profile, but maybe it’s a cute little fox holding a heart instead of a basic red heart or yellow star. Yeah, this makes posts subject to Discord Reaction Spam, but I personally think it’s endearing in its own right.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\" alt=\"Senil pointing towards the viewier, winking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil pointing towards the viewier, winking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Imagine getting to spell out “KUNG POW PENIS” on someone’s post because of some bullshit they said.</p>\n<h3 id=\"a-nicer-default-web-ui-ux\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#a-nicer-default-web-ui-ux\">A nicer default web UI/UX</a></h3>\n<p>Something that base Mastodon struggles with, in my opinion, is a web experience that most folks might enjoy. The mobile phone UI is atrocious - <a href=\"https://furry.engineer/@senil888\">go to my Mastodon profile on your phone yourself</a> - what with the column on the right eating up precious horizontal real estate, and the desktop web UI leaves something to be desired personally. Everything is handled via the text box on the left of the screen, meaning replies can get awkward to manage and set up.</p>\n<p>Meanwhile, Iceshrimp (Misskey in general, but again I used Iceshrimp) has a nice UI that translates well across desktop, tablet, and mobile. It <em>feels</em> like it belongs on all fronts, and that it was designed to fit those environments as best as possible - I used the mobile website pinned to my home screen the entire time. It’s not perfect, mind you - Iceshrimp’s UI on desktop is REALLY spread out, when I’d appreciate a more central layout that’s a bit narrower, something that Sharkey (a different Misskey fork) does have. I got used to it over time, but it was something I’d have preferred out of the box.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>The web UI is also customizable - you can use your choice of themes on the server, find someone else’s to use yourself, or create your own color palette if you so desire. It also respects whatever your browser is set to regarding light or dark mode, so it’ll swap between those whenever your computer says so. The right side bar? Can be set to show recent notifications, a small posting form if you want, a <em>clock</em> or calendar, or nothing at all! It’s a small touch - I personally set it up to show me server performance statistics, so I could watch how things ran in real-time.</p>\n<p>The VPS was total overkill for a single-user instance federated to whoever I followed, and the <a href=\"https://relay.infosec.exchange/\">infosec.exchange relay</a>.</p>\n<h3 id=\"post-importing\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#post-importing\">Post importing!</a></h3>\n<p>This was something carried over from its original base, being the now-dead Firefish (which, yes, was another Misskey fork that a lot of Misskey forks forked from, it’s confusing). Unfortunately, that post import tool hadn’t gotten necessary love and a security flaw was found where it didn’t really respect certain privacy settings on Mastodon posts, so the Iceshrimp team totally disabled it. For good reason, especially given that it wasn’t touched since it was first added in Firefish.</p>\n<p>Iceshrimp dotNET is supposedly bringing post importing back - which I hella appreciate. Especially since you could even import a Twitter archive. Something I’d love to see dotNET do that Iceshrimp JS doesn’t is to <em>not re-upload media from links.</em> This was something I noticed when I imported my Twitter archive into Sharkey - which had the same mostly untouched Firefish import tool - and it straight-up uploaded the media of <strong>every single retweet</strong> I ever made.</p>\n<p>For hopefully obvious legal and copyright reasons, that’s Not Good, and I’d rather posts with media either link back to the original somehow, or use a link to the image on Twitter (or wherever else)'s servers. Not perfect, and this is assuming that’s realistic to implement, but it’d make the post import feature a 10/10 for users, and an 8/10 for instance admins. Much less junk uploaded to a user’s drive that they legally shouldn’t!</p>\n<h2 id=\"what-i-didn-t-really-like\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#what-i-didn-t-really-like\">What I didn’t really like</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>So, Misskey and co. are still bloated, and there were a variety of features that Iceshrimp JS has that other software doesn’t have (and that Iceshrimp dotNET won’t, either). Fortunately, none of these are super major and are easy enough to ignore.</p>\n<h3 id=\"the-god-damn-chat-system\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#the-god-damn-chat-system\">The god-damn chat system</a></h3>\n<p>For SOME REASON, the Misskey developers have a <em>totally separate</em> chat system that exists outside of the “normal” direct messaging system, which is basically a normal post that only goes to people you mention (with the caveat that mentioning another user also reveals every previous post). Chats on Misskey can <em>kind of</em> work with DMs, but stuff federates weirdly and just doesn’t cooperate all that well. Fortunately, Iceshrimp dotNET is getting rid of the separate system while working on a UI similar to it that uses normal direct messaging like everything else does.</p>\n<p>I briefly toyed with the chat system. I don’t think it’s good. Just use DM’s like everyone else, or message on a different platform. Custom emoji’s didn’t even federate between two Misskey-based instances.</p>\n<h3 id=\"clips-channels-antennas\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#clips-channels-antennas\">Clips? Channels? Antennas?</a></h3>\n<p>I really have no idea what clips or channels are meant for - and either way, they don’t really federate outside of the server well (if at all), so they’re really pointless for small instances. Antennas, though, are meant to be Iceshrimp’s customizable version of following tags, a staple across platforms. They’re… annoying to configure, though. And by annoying, I mean really annoying.</p>\n<p>It’s been a while since I’ve touched Iceshrimp, but I remember spending a while looking at documentation trying to figure out how to just follow posts with a “#FurryArt” tag. I eventually got it to work, but it came with a flaw of its own - antennas show posts <em>in the order it finds them</em>, NOT in reverse chronological order. A post the antenna finds might be five days old that it just stumbled across, followed by a two day old post right below it. It is a more customizable system than just following tags, since you could also filter <em>out</em> words and phrases too - say, follow “#FurryArt” but don’t show anything also tagged “#NSFW”, or something of that nature.</p>\n<p>It’s a very expansive system that I appreciated, but it felt way too clunky and fairly unintuitive. Posts showing up whenever they arrived, and not displayed in the same reverse chronological as the main timelines, was the sad icing on top for me. If antennae were either a separate timeline entirely, <em>or</em> displayed posts reverse chronological instead of “whenever they arrive”, I’d tolerate their clunkiness more, purely because it’s a much more expansive system than basic tag following.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h3 id=\"iceshrimp-doesn-t-have-manual-account-approval\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#iceshrimp-doesn-t-have-manual-account-approval\">Iceshrimp doesn’t have manual account approval</a></h3>\n<p>Something a lot of fediverse software supports is registration with manual approval - anyone can technically sign up, but you won’t actually be let in unless a moderator OKs it. This is a pretty easy anti-bot system, since you’re not <a href=\"https://www.boia.org/blog/how-to-make-captcha-accessible-to-everyone\">relying on a CAPTCHA that can easily make your service less accessible</a> and thus harder to sign up for with open registration - plus, a CAPTCHA system doesn’t stop real people from signing up and abusing your server. Iceshrimp <em>does</em> have an invite system, but it’s based on invite codes that you have to punch in, instead of an invite link you can just click and boom, you’re granted access because you’re (presumably) trusted.</p>\n<p>This is something Iceshrimp dotNET is going to be adding in due time, but it was a turnoff for me in terms of running something publicly. I don’t want to force people to deal with the kinda clunky invite code system, but I also don’t want to leave the server wide-open and ripe for abuse by trolls. Some other Misskey forks - Sharkey being the one I toyed with very, very briefly - do have registration with approval. That was honestly a major factor in me wanting to use that for multi-user hosting - despite me overall liking Iceshrimp more.</p>\n<h3 id=\"the-drive-system-1\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#the-drive-system-1\">The drive system…</a></h3>\n<p><strong>“Wait, didn’t you say you really liked it?”</strong></p>\n<p>Yes, I did. And I do like it! But it does present some flaws that I can’t ignore. Chief among which is “what is going to prevent users from treating this like a cloud drive?” - capacity is easily capped, but outbound traffic isn’t free if you’re using an S3 bucket for file storage. Of course, it’s easy to just look at who is using a ton of storage and go “hey, please tell me you aren’t abusing this.” Users with admin access <em>can</em> view the contents of everyone’s drives - something that I would ONLY ever want to do if I absolutely believe a user is abusing the drive system, or to. You know. Delete copyright or illegal materials hosted there.</p>\n<p>There’s also the matter of juggling how much space to give people, how big to let uploads be, so on and so forth. I’ve crunched some numbers and I think a realistic number that most folks won’t hit - especially with server-side image and video compression - is around five gigabytes. More than enough space for photos and selfies, short video clips, etc. Iceshrimp isn’t meant to be a gallery site like Pixelfed is, and I personally find striking that balance to be hard. But that’s just, like, my opinion.</p>\n<p>While I said the drive system is great for budgeting the theoretical maximum S3 storage might cost, it might make it harder to change that down the line. I have no idea what happens if you try to shrink the per-user drive allowance while some users have exceeded the new, smaller limits. I don’t think I’d want to find out. Growing is is clearly no problem, but it might be easy to give everyone more storage than really needed, and then have to clamp down on storage as more users join in order to keep storage costs lower. I might just be stupid in assuming that, though.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying face-down on the ground, with a low battery symbol above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying face-down on the ground, with a low battery symbol above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>I don’t think the drive system is remotely bad - I think it’s a very good idea, and a roundabout way to estimate worst-case costs for S3 object storage, should you pay for that. It’s just, well, “A Drive”, which means you now need to deal with everything “A Drive” entails. And I <em>really</em> don’t like that admins can just zoom in and see the contents of someone’s drive for privacy reasons, whether it’s been posted anywhere (even in a private DM!), but I <em>do</em> get it from an admin view, especially when it comes to users hosting blatantly illegal content that can get an instance shut down. Makes it easier to clean them up, maybe?</p>\n<h2 id=\"so-yeah\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/my-time-with-iceshrimp/#so-yeah\">So… yeah</a></h2>\n<p>I really enjoyed my time with Iceshrimp - I’d probably still use it if it wasn’t for the frustration that is “federating a single user instance”. I love the software, despite some of its quirks, and I’m really looking forward to what Iceshrimp dotNET is going to bring to the table as it gets more and more polished.</p>\n<p>In the meantime, I’ll just chill out on Mastodon and deal with the “meh” in my eyes. I’ll move over at sime point, maybe self-host again on a cheaper VPS if I don’t run it on my own box(es).</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\" alt=\"Senil sprawled on his back, sleeping. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil sprawled on his back, sleeping. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>",
      "date_published": "2024-11-02T00:00:00Z"
    },{
      "id": "https://blog.senil.me/splatling-initial-prep/",
      "url": "https://blog.senil.me/splatling-initial-prep/",
      "title": "Splatlings - Initial design",
      "content_html": "<p>Yep! I want to build the splatlings from Splatoon 3 - eventually I want to build the Hydra splatling, but I’ll be starting off with splatlings that focus more on developing specific techniques before moving onto the splatling that will ask the most of me. From learning how to make stuff look metallic, molding materials to form the “metal” canister, fire hydrant, and support bar… the Hydra will take a lot from me.</p>\n<figure><a href=\"https://cdn.wikimg.net/en/splatoonwiki/images/d/d1/S3_Weapon_Main_Hydra_Splatling.png\"><img src=\"https://cdn.wikimg.net/en/splatoonwiki/images/d/d1/S3_Weapon_Main_Hydra_Splatling.png\" alt=\"The Hydra splatling from Splatoon 3\" loading=\"lazy\" style=\"\" /></a><figcaption>The Hydra splatling from Splatoon 3</figcaption></figure>\n<p>There are three splatlings I want to build, each of them focusing on different aspects.</p>\n<h2 id=\"the-ballpoint-splatling\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/splatling-initial-prep/#the-ballpoint-splatling\">The Ballpoint Splatling</a></h2>\n<p>This splatling build will focus primarily on the building aspect. The main hurdle I anticipate is the clear plastic part that makes up like, half of the build. This is going to involve a <em>lot</em> of plexi-molding, 3D printing, and a lot of attention to detail to make what I build look, like, well. A giant ballpoint pen - one of the ones with multiple ink barrels.</p>\n<figure><a href=\"https://cdn.wikimg.net/en/splatoonwiki/images/f/f9/S3_Weapon_Main_Ballpoint_Splatling.png\"><img src=\"https://cdn.wikimg.net/en/splatoonwiki/images/f/f9/S3_Weapon_Main_Ballpoint_Splatling.png\" alt=\"The Ballpoint splatling from Splatoon 3.\" loading=\"lazy\" style=\"\" /></a><figcaption>The Ballpoint splatling from Splatoon 3.</figcaption></figure>\n<p>At some point I want to add a motor, some lights, a speaker, and some other things to really sell that “this is pulled straight from the game” - however, that’s a “later me” problem. I <em>do</em> plan on initially designing with that goal in mind.</p>\n<h2 id=\"the-heavy-splatling\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/splatling-initial-prep/#the-heavy-splatling\">The Heavy Splatling</a></h2>\n<p>This one will focus on the electronic side of everything. Motors, sounds, lights, controls, etc. My biggest concern with the Heavy splatling will be the motor design. My sister’s wife suggested a weak DC motor, and I’ve contemplated setting it up to be belt driven since it <em>might</em> enable me to use similar motor code to drive every other splatling I build.</p>\n<figure><a href=\"https://cdn.wikimg.net/en/splatoonwiki/images/5/5e/S3_Weapon_Main_Heavy_Splatling.png\"><img src=\"https://cdn.wikimg.net/en/splatoonwiki/images/5/5e/S3_Weapon_Main_Heavy_Splatling.png\" alt=\"The Heavy splatling from Splatoon 3.\" loading=\"lazy\" style=\"\" /></a><figcaption>The Heavy splatling from Splatoon 3.</figcaption></figure>\n<p>The Heavy splatling is also going to be 90% about the code, and will be the starting point for the code design I want to achieve. My end goal is a relatively modular code setup that’s segmented in ways that should <em>hopefully</em> minimize the re-writes necessary. Stuff like changing the how long it takes to hit the first and full charge, how long it fires based on how long it’s charged, all sorts of stuff I want to make as re-usable as possible.</p>\n<p>Both because it’ll make my life easier when it comes to future splatling builds, and also to (hopefully) make it easier for others who want to build a splatling themself.</p>\n<h2 id=\"the-hydra-splatling\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/splatling-initial-prep/#the-hydra-splatling\">The Hydra Splatling</a></h2>\n<p>This one will be the thing to merge everything together. Electronics, building, the works. The build will be the hard part, mostly because the Hydra is my main weapon in Splatoon and I want to put my all into it. Making stuff look like it’s actually metal, figuring out how to build a <em>cast iron fire hydrant</em> without building it from cast iron, the Works. It’ll be a challenge, and definitely one I want to save for last.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/SenilHydra.png\"><img src=\"https://blog.senil.me/assets/images/SenilHydra.png\" alt=\"Senil leaning on the Hydra splatling. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil leaning on the Hydra splatling. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>",
      "date_published": "2024-10-27T00:00:00Z"
    },{
      "id": "https://blog.senil.me/tablets-are-kinda-shit/",
      "url": "https://blog.senil.me/tablets-are-kinda-shit/",
      "title": "Tablets are kind of shit right now.",
      "content_html": "<p>So, uh. What do I mean here? Well, through a couple things I’ve read and watched lately, I’ve formed Feelings and Thoughts regarding the current space of tablets. And in my genuine opinion, they all kind of… suck. Not to say the iPad isn’t great for art, or there isn’t value in a nice Android tablet, or that Windows tablets aren’t (technically) capable of running productivity software. It’s just, well, there aren’t really options that fit what I would <em>personally</em> love to see.</p>\n<p>(update: addenum to the Windows tablet section as of 8:20PM Pacific, 2024-10-26)</p>\n<h2 id=\"android-s-tablet-ui-ux-sucks\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#android-s-tablet-ui-ux-sucks\">Android’s tablet UI/UX sucks.</a></h2>\n<p>OK, so let’s start things off with the Android tablet sphere, because my phone is Android so that’s more what I’m familiar with UI/UX wise. Android tablets are… usually not great. Not necessarily for poor specs, the high-end Samsung Galaxy tabs are <em>really good</em> and try to punch at the same “great for drawing/note taking/art” level that nicer iPads target. It’s just, outside of apps purposely targeted for tablets and tablet productivity, the Android tablet experience is really just “big phone” - which is not good. In part, this is because Android tablets were never really taken seriously outside of “big phone” and general purpose media consumption device, and nobody has really made a “productivity” Android tablet outside of Samsung.</p>\n<p>I don’t count the Pixel tablet because it’s more trying to be an Android tablet that can also act as a Nest Home hub thing whenever you dock it. Which is really neat and I like that idea. It’s just only good at note-taking otherwise, courtesy of USI 2.0 stylus support.</p>\n<p>So, Android tablets are kind of a wash because UI/UX isn’t really meant for that just yet. I’m wrapping ChromeOS up in this section too because it’s the same problem - everything is still primarily geared around the desktop experience, and because a lot of things aren’t designed around Android tablets (let alone ChromeOS tablets) they suffer from the same “big phone” experience - though my basic note-taking app that works on ChromeOS, <a href=\"https://www.squidnotes.com/\">Squid</a>, has a really nice tablet-centric UI on the way. I like it a lot.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HeartSenil.png\" alt=\"Senil hugging a big pink heart. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil hugging a big pink heart. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"windows-tablets-sadly-aren-t-much-better\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#windows-tablets-sadly-aren-t-much-better\">Windows tablets sadly aren’t much better.</a></h2>\n<p>In part, the Windows tablet experience sucks because ever since Windows 8, Microsoft has really dialed back the touch-centric features of Windows. I totally understand why, since Windows 8 was widely hated because it forced the touch-centric UI/UX onto everybody, regardless of whether you even had a touchscreen available. But it unfortunately means that Windows 11 is <em>terribly suited</em> to a tablet-focused experience as a result.</p>\n<p>I <em>love</em> the overall style of the Surface Pro, and I think the built-in kickstand makes it better suit as a productivity machine as well. Yes, the keyboard setup sucks but I doubt the Magic Keyboard Folio is that much better. Unfortunately, it’s hampered by Windows itself. And extra unfortunately, because the Surface Pro now runs a Snapdragon ARM CPU, it’ll forever be at a disadvantage software wise. I only see that changing if Windows on ARM because a HUGE deal in the coming months and years - and for more ARM chipsets to be powerful enough to provide a solid Windows experience.</p>\n<p>Which is something I doubt will happen because a large install base of Windows machines is desktops, and good luck convincing PC gamers and co. to switch to Linux or find a way to get existing hardware to work via ARM. It’s possible, since the Ampere ARM CPUs (that are meant for servers) do support PCIe 4.0, so technically it’s possible, but we’d need to see consumer desktop-oriented CPUs start to exist first that offer comparable performance to at least last-gen hardware.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SleepySenil.png\" alt=\"Senil sprawled on his back, sleeping. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil sprawled on his back, sleeping. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h3 id=\"addendum-windows-still-sucks-regardless\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#addendum-windows-still-sucks-regardless\">Addendum - Windows still sucks, regardless.</a></h3>\n<p>I was talking about the state of Windows on ARM last night around when this post went up, and I wanted to wrap some of that into this post, too. The basics is that - despite Microsoft being the one who needs to make “Windows on ARM for productivity” a reality, it means making Windows <strong>something people want to use.</strong> With Microsoft shoe-horning Copilot+, Recall, and who knows what else is in the pipeline, a lot of people don’t trust Windows. I know I don’t - my laptop runs Linux and the only reason my desktop will continue to runs Windows is because <em>my tools don’t work on Linux.</em> It’s not because I LIKE Windows as an OS - it’s <em>okay</em>, but there’s a lot of flaws in it that Microsoft won’t address.</p>\n<p>Because they’re all in on AI, and so a lot of their money - money that could be spent updating Windows and making it something people <em>choose to use</em> - is going towards a fad few people care about when people want their damn operating system to work <em>with</em> them, instead of us having to work with Windows. Windows is a monolith. People use it because it’s what everything has always used, it’s what your new laptop from Best Buy or Walmart comes installed with unless it’s a Chromebook or Macbook.</p>\n<p>I <em>want</em> to see Microsoft push “Windows on ARM is great for productivity!” when it comes to CAD and engineering tools, but people will only care for Windows on ARM specifically if Microsoft can make Windows on ARM worth running. And most people don’t really like Windows at this point. Which fuels the fire <em>against</em> Apple doing anything to make the iPad Pro the true compute powerhouse that it totally could be.</p>\n<p>(anyways, back to the original post)</p>\n<h2 id=\"the-ipad-pro-is-overpowered-for-its-software\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#the-ipad-pro-is-overpowered-for-its-software\">The iPad Pro is overpowered for its software.</a></h2>\n<p>I’m not going to go into the weeds here, because <a href=\"https://www.youtube.com/watch?v=J5wEUpLrQK0\">Dankpods has already done a good video talking about this</a> and <a href=\"https://blog.sebin-nyshkim.net/posts/apple-has-no-idea-what-to-do-with-the-ipad/\">Sebin has as well, though more about how complex the iPad range is now</a>. I really do agree, because iPad OS isn’t great. And a lot of productivity apps that exist on both iPad OS <em>and</em> Mac OS generally gimp the iPad version for some reason or another. From a technical standpoint, there isn’t any <em>practical</em> reason now - the iPad Pro’s run M-series chips (The Pro’s run the iPad exclusive M4, and the Air’s run on their M2), which power their Macbook’s, Mac Mini, Mac Studio, and <em>Mac Pro</em> - though those generally have the higher-end variants, it’s still the desktop-grade silicon.</p>\n<p>Which is what infuriates me the most. I personally will never buy an Apple product unless I can <a href=\"https://asahilinux.org/\">install something like Asahi Linux</a> on it, so it’s not like I’d touch an iPad. But it annoys me that Apple now has iPad’s that could, <em>in theory</em>, run desktop MacOS and run desktop-grade apps, but they’re limited by the garbage that is iPad OS. An iPad Pro that runs a touch-focused version of MacOS would be a <em>massive</em> improvement in my opinion, largely because, well, it’d be a high-end tablet running a desktop OS that’s been designed around ARM since 2020. You could build a strong Windows ARM tablet any day of the week, but Windows on ARM will have to co-exist with x86_64 Windows for a long while - even if Microsoft gets a very efficient system to run x86_64 apps on ARM, most everyone is going to build for x86_64 still.</p>\n<h2 id=\"giving-an-ipad-macos-might-drive-competition\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#giving-an-ipad-macos-might-drive-competition\">Giving an iPad MacOS might drive competition.</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\" alt=\"Senil flexing his biceps, smirking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil flexing his biceps, smirking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p><em>(key word being MIGHT)</em></p>\n<p>In my opinion, a large part of why tablets suffer is because they’ve existed in this weird limbo for a while now. Most of the time they’re used as media consumption devices that are more portable than a laptop, but still much larger than a phone. Some tablets get used for at least note taking and some basic document work, higher-end ones are getting used for digital art too - and that’s a relatively recent development. The idea of a true productivity-focused tablet has somewhat existed in Microsoft’s Surface tablet lineup, but x86_64 Windows tablets generally have poor battery life, and Windows on ARM is just now proving to be remotely viable.</p>\n<p>In my perfect world, if Apple gave an iPad Pro a touch flavor of MacOS - still able to run standard MacOS apps and whatnot, just with a more touch-friendly UI/UX - it would pressure companies like Microsoft to push harder for Windows on ARM and bring it up to parity, especially with the needed work to get x86_64 to ARM working smoothly and without fuss. It might get companies like Samsung to push for a better Android tablet experience, or release their own Windows on ARM tablet that trades blows with Microsoft’s - they have plenty of experience with their Galaxy Tab lineup, after all.</p>\n<p>If Apple’s go proves popular enough, it might convince productivity app developers to work on ARM versions that work as well as their x86_64 offerings too, or at least make sure their x86_64 versions run good on a high-end ARM machine. Something that I’d massively appreciate, since so many productivity tools are limited to Windows only, and you have to fight to get them to work on other platforms. If ARM becomes more prevalent on Windows, it’ll hopefully push them to make ARM-focused builds too.</p>\n<h2 id=\"freedom-of-choice\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#freedom-of-choice\">Freedom of choice</a></h2>\n<p>I envision a reality where someone’s operating system of choice isn’t a major barrier in using software. I run a Linux laptop. I want to run AutoCAD Fusion for 3D modeling work. There does not exist an official build of Fusion for Linux, and while hacky methods exist… <em>they’re hacky methods</em>. Where the only limits imposed on how well software runs is the form factor of a device - a desktop with powerful cooling, a hefty power supply, and strong dedicated graphics could run stuff smoother than a powerful but limited laptop, which will run better than a tablet with no air cooling.</p>\n<p>That reality isn’t going to happen, for admittedly good reasons. You don’t really want someone to install heavy 3D modeling software on Nana’s $500 laptop from Best Buy and then complain that it runs like shit, let alone someone’s tablet that’s strong but would overheat in two seconds flat.</p>\n<p>I just wish there was user choice and agency in the matter.</p>\n<h2 id=\"which-is-why-i-want-to-build-dumb-shit\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/tablets-are-kinda-shit/#which-is-why-i-want-to-build-dumb-shit\">Which is why I want to build dumb shit</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/LaughingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/LaughingSenil.png\" alt=\"Senil laughing on the floor. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil laughing on the floor. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Seriously, part of my motive for my dumb computer-oriented projects I’ll share here - like my stupid “shove a Framework 13 mainboard into a modded Wii U Gamepad” concept - is to see what it takes to build a comfortable compute experience. The Wii U gamepad mod is meant to be silly and make you go “This is a Steam Deck, but it isn’t”. I want to see if I can build bespoke tablets that run on a Framework, too - if I can get a screen with the appropriate eDP port <em>and</em> USB touch (yes, the Framework 13 eDP port looks to support USB 2.0!) then I might be able to build a weird looking but perfectly capable tablet, running full-fledged desktop Linux.</p>\n<p>There’s even a RISC-V board a third party company is developing, though Framework makes it clear it’s for development use only and should not be used as a daily driver mainboard. Perhaps I could run that once it’s fine-tuned, and get the benefits of RISC-V. The sky - and limits of the Framework form factor - is the limit. And I want to discover what’s possible by building this bespoke stuff myself.</p>\n<p>Sure, there’s ARM-based single board computers, but I want to build something that feels “integrated” in a way, and make it as straightforward as possible for <em>someone else</em> to build it, too. Using the Framework board and battery is about the easiest way I could manage that, especially since the mainboard layout isn’t too likely to change for some time.</p>\n<p>Maybe I’ll run into a clever idea one day, and see what it takes to make it into what I “dream” of. It won’t be perfect, but it might get close enough.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\" alt=\"Senil happily tossing confetti in the air. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil happily tossing confetti in the air. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>",
      "date_published": "2024-10-26T00:00:00Z"
    },{
      "id": "https://blog.senil.me/rip-cohost/",
      "url": "https://blog.senil.me/rip-cohost/",
      "title": "Rest in peace, Cohost",
      "content_html": "<p>Cohost is shutting down the end of the year. While I’m kinda sad because it was a good experiment to see if non-federated social media could be viable that doesn’t rely on selling data or anything, I think Anti-Software Software Club just made too many assumptions that didn’t or couldn’t pan out. Including just… not understanding what they wanted in the end.</p>\n<p>This post was originally a three-part tumblr post, so it’s very long. Part “one” was what I think went wrong, part “two” is why I think a federated model “works” a bit better than centralized (though it’s flawed, too), and there’s a “TL;DR” part that <a href=\"https://blog.senil.me/rip-cohost/#the-tl-dr-of-my-thoughts-re-cohost-shutting-down\">I’ll just link to here if you want to skip the many, many paragraphs below.</a></p>\n<h2 id=\"what-i-think-they-assumed\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#what-i-think-they-assumed\">What I think they assumed</a></h2>\n<p>Number 1 mostly being them being “blindsided” by Stripe clarifying their policy that, in the end, means ASSC couldn’t use them as a way for users to tip each other or the Artists Alley section and such. That policy existed for years, well before Cohost ever existed. For context, ASSC originally wanted to build a Patreon competitor, not a social media site. They would have failed so hard if they stuck to a Patreon competitor on this alone.</p>\n<p>And in my opinion, number 2 is their pay. They were paying themselves very well-off all things considered, and everyone was paid the exact same amount (~94k last I heard). That’s… a lot of money going towards pay that could’ve gone to hosting costs. They’re a startup. You pay yourselves what you can. I appreciate that they paid themselves well, but again. Startup. You pay what you can, and they were nowhere close to breaking even at any point.</p>\n<p>I think their financial model didn’t do themselves any favors - they started out with “we got a lot of loan money to do this and now we have to make it profitable” which, yeah, sometimes that’s what it takes. But that’s venture capitalism. Especially since Cohost’s source code WAS the collateral! They acted as a leftist group trying to market themselves as a non-profit/not-for-profit (they’re a LLC, they’re legally not forced to do either), paying themselves well more than they realistically, and hoped they could get enough people to subscribe monthly to break even.</p>\n<p><strong>That… doesn’t work.</strong></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/DrainedSenil.png\" alt=\"Senil lying flat on his stomach. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil lying flat on his stomach. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Not to say this would’ve fixed things, but I think them registering as an LLC didn’t help. That prevented them from bringing on anything resembling a volunteer, and since their whole thing was “everyone gets paid the same” it meant they had to operate with very few people. If I recall correctly, they had one moderator. Maybe two. Maybe. Two developers, an artist, and a moderator. Four people. MAYBE five, I forget the exact number.</p>\n<h2 id=\"hypothetical-territory-ahead\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#hypothetical-territory-ahead\">Hypothetical territory ahead</a></h2>\n<p>Being a non-profit comes with its own set of problems, but if they could become and maintain a 501©3 non-profit, they could pay themselves what they could and have people willing to help volunteer moderate. They could never get code contributors, though, since their source code was their collateral it by nature had to be closed off. Also, donations (recurring or one-off) are tax-deductible for US-members, so while it’s not a HUGE benefit it offers at least that small bonus.</p>\n<p>I’m glad that they tried, and got as far as they did (even if it meant loan after loan to not die instantly). It showed that it could be possible - that there’s hope in this idea. It’s just a question of HOW to make it a sustainable reality. I don’t think there’s a clear answer there, though. Like my non-profit idea hinges heavily on maintaining 501©3 status (or similar) and being able to bring on volunteers as-needed. Using a public spec for the back-end (like ActivityPub or ATProto) so the focus can be on implementing it (even if federation is never a thing) instead of doing it raw - which avoids the back-end development time but then means having to work with an existing spec that may or may not change substantially over time.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/SadSenil.png\" alt=\"Senil curled into a fetal position, sobbing. Art by [Dragonjourney](httpss://x.com/Dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil curled into a fetal position, sobbing. Art by <a href=\"httpss://x.com/Dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>I don’t know. I have no idea what would make a medium-form social media such as Cohost viable. Maybe it’s the same idea but with lower pay so it’s easier to bring new people on as-needed, with the expectation that this is a passion project ‘til it gets off the ground. Maybe it takes the “use a public spec for back-end” approach and focuses on the implementation of it with their own additions and flair. ActivityPub is one spec, but you have Mastodon, Pixelfed, Misskey, Wafrn, etc. that all go in different directions. ATProto will likely be the same one day - Bluesky being the obvious “reference” implementation right now, and then various other flavors that go their own direction with ATProto down the line.</p>\n<p>Maybe it’s something else entirely that I could never ever think of. All I do know is that I’m glad they tried. Unfortunately, the writing has been on the wall for months now and honestly? If you didn’t expect that, that’s on you. People have been saying that Cohost wasn’t sustainable for months.</p>\n<h2 id=\"why-i-think-the-federated-model-works-kind-of\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#why-i-think-the-federated-model-works-kind-of\">Why I think the federated model “works” (kind of)</a></h2>\n<p>So part of what makes the fediverse (Mastodon, Pixelfed, Misskey &amp; co., Wafrn, etc. for your Twitter/Instagram/Tumblr vibes) work from a financial view is that costs are spread out across tons of instances, and there are tons of ways to host this stuff. Either from a dirt cheap VPS from Hetzner that hosts a dozen people, to a hundred-ish instance that runs locally with solid redundancy, to a thousand-ish instance that ALSO runs locally (but is suffering growing pains from VPS to local transition IIRC), to a multi-thousand user instance that runs on… something? I don’t know what meow.social uses.</p>\n<p>But those costs are on a per-instance basis, and there are tons of ways to shift that cost perspective around to make things cheaper, or accidentally make things more expensive. Using a more costly VPS service, expensive S3 storage, expensive CDNs to make stuff available more better (extra useful for those huge instances that cross the thousand-member mark), etc. There are various ways to make it expensive.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil screaming in fear, hands on his head. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil screaming in fear, hands on his head. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>But there are ALSO various ways to make the hosting cost go down. Running local boxes means the only hosting cost (outside of external S3 buckets, CDNs, etc.) is the up-front purchase cost of hardware, upgrades over time, and your time-cost of keeping them running (though you might be able to make it set-and-forget enough to where a VPS might be set-and-forget). Forgoing S3 buckets and a CDN mean everything goes through your local boxes, which’ll up local storage needs but again, those are up-front purchases (though you might need to upgrade to small business internet to keep your ISP happy, which I guess counts towards hosting costs but you also live there so…)</p>\n<p>This is, of course, only considering hosting stuff. Pretty much all fediverse instances, as far as I’m aware, run on totally volunteer labor. These instances are passion projects of the admins and mods, run for the sake of running it and to provide community to folks online. If you were to start paying for their time administrating and moderating, then you start to see instance costs go higher and higher (varies on what instances pay folks, how they handle time spent, etc.). That IS a part of the equation that the fediverse does not explicitly handle.</p>\n<p>The same “passion project” logic is a large part of fediverse softward development outside of the big projects like base Mastodon and <em>maybe</em> Pixelfed - those are developed in large part by actual organizations who pay people to do the bulk of the work. But here’s the kicker - other people can also help out. Submitting feature requests, bug fixes, issues, etc. to the teams directly means there’s a chance of problems getting fixed or features added that other developers have the passion to show how to implement it, or discuss how to handle it with the folks who run the project.</p>\n<p>That’s of course something Cohost could never benefit from, because the source code itself was used as collateral for their initial loans. They could never open source it under any terms without the express permission of the loaner, who would likely veto the idea anyways, because there goes the motive to keep it as collateral. They can’t have other people contribute bug fixes or program new features to help them out.</p>\n<h2 id=\"paying-people-to-run-a-service-is-important\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#paying-people-to-run-a-service-is-important\">Paying people to run a service is important</a></h2>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/HowdySenil.png\" alt=\"Senil pointing towards the viewer, winking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil pointing towards the viewer, winking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>Cohost does have the benefit of, y’know, paying everyone for their time and energy… but that costs money that I don’t think they considered how to structure. They only ever had one, maybe two moderators for THOUSANDS of users. Yeah, they’re paid, but they literally only have so much time in a day to moderate things - and they can’t be awake 24/7 to watch over things, while volunteer mods might be in various time zones or have different work schedules so there might always be a person or two to monitor stuff.</p>\n<p>I know there’s nothing that can really bridge that monetary gap - paying people and everything around that costs a lot of money, which can scale way faster than hosting costs. The instance I’m on (which shares staff and such with another instance and a Lemmy one so it’s not super fair) has seven people listed as staff. I don’t know how much work they actually put in (or need to put in) to moderating and administrating everything a week, let’s just go with 20 hours a week per person, or 140 hours total per week.</p>\n<p>At my state’s minimum wage (bout $16 an hour right now) that’s around 116.5k annually, or 9710 a month, give or take. I don’t know the exact hosting costs since IIRC stuff is now hosted locally, and I don’t know what additional regular “costs” exist beyond whoever’s basement this is all at, but whatever it was it now requires an extra 9710 a month to break even.</p>\n<p>We have a listed “active user count” of 844 between furry.engineer and pawb.fun - I’m not counting the Lemmy instance because that’s a much harder figure to find. I’m also assuming there are zero duplicate accounts between the instances, and everyone is totally unique. In order to raise enough money just to pay every my state’s minimum wage at 20 hours a week (treating this as a part time job, basically), each member would need to contribute about 11.5 bucks a month to just pay the staff team for their admin and mod work. Probably add in a couple more bucks to help cover any added costs like better internet, increased power bills, etc. and suddenly you might be looking at 15 bucks a month to pay everyone a minimum wage part-time job’s worth of labor and help cover self-hosting fees.</p>\n<p>That’s not a lot of money all things considered - since this is a passion project of sorts I don’t expect this to be a full-time job, especially since nobody is really doing active development work like the Cohost team was doing. But that’s still money to keep it up and running. BUT! There’s a small beauty in all of this.</p>\n<h3 id=\"larger-instances-don-t-necessarily-need-a-ton-more-mods-or-people-behind-it\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#larger-instances-don-t-necessarily-need-a-ton-more-mods-or-people-behind-it\">Larger instances don’t necessarily need a ton more mods or people behind it.</a></h3>\n<p>Take meow.social - a furry instance with about 2.3k active users. I don’t know how exactly they host things, but they have a transparency report that goes over what they raise via Patreon monthly as well as their expenses, and it seems like it trends to around 300 bucks a month for hosting and such. They have two admins and four moderators - taking my same “part time job, my state’s minimum wage” estimate, we’re looking at an additional $8320 a month to pay everyone. Let’s round up that plus the rough hosting cost of 300 to a straightforward $8700 a month. Recall that they have 2300 active users. If every active user donated to meow.social to pay their staff and keep it running, <strong>they’d only need to donate $4 a month on average to keep it going.</strong> Toss in some extra to help build up a small savings for future upgrades and badabing badaboom, you have a functional instance running at not that much all things considered.</p>\n<p>Meow.social is based in France though, so the reality is these numbers are probably low but the point remains that staff plus user count doesn’t have to scale that much, but you should still have plenty of mods to be effective.</p>\n<p>However, meow.social is still a passion project - everyone part of running it has real jobs outside of it, the paying part is just a “thank you” of sorts to help cover their time and reward their efforts. And that’s kinda the bridge between fediverse projects, which are generally run as a passion project and any donations/payments are a “thanks for keeping this going” deal. While a brand-new social media, which has the development costs of building the damn thing on top of hosting and paying people, is GOING to cost more money because you have to pay for the development work too, which is definitely a full-time job that’ll have to pay decent enough to entice people to work there and stick around.</p>\n<p>It’s why I mildly get the Cohost team paying themselves well - it’s not exactly easy work doing all of this. And it’s not like I know their exact numbers on hosting costs, development time, legal fees, etc. that factor into everything. But I still think that maybe there was something that they could’ve done differently to stay on top of things better, and maybe. Just maybe. Pull off the ultimate mission of “making centralized social media that doesn’t suck for users.” That’s why I applaud the Cohost team for trying, and succeeding (ish) for so long.</p>\n<p><strong>They suggested that this might actually be possible, if things worked a little differently.</strong></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfettiSenil.png\" alt=\"Senil happily tossing confetti in the air. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil happily tossing confetti in the air. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"the-potential-of-cohost\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#the-potential-of-cohost\">The potential of Cohost</a></h2>\n<p>Put more effort into the core product and fixate on one idea instead of trying to come up with a different one, leaving the core product untouched for months. Maybe use existing back-ends to kick-start development, so that you aren’t building entirely from the ground up and have reference implementations of various things to help get the project going (aka my idea of using ActivityPub or ATProto as the back-end, with the intent of never allowing federation). Paying yourselves a bit less to compensate for “this is a start-up effort” and prioritize having more of the support crew as-needed.</p>\n<p>I know that there’s potential here. I don’t know how to go about it, or if it’s even worth the initial investment to try, but I at least think that it might maybe be viable. It’ll take some clever thinking, but ultimately Cohost was a starting point in the effort to return to a less-scummy web. They started the path to proving it’s possible, even if in the end they failed. Hopefully some other crew picks up the torch and goes farther, having learned from what likely did Cohost in and doing better.</p>\n<p>Ultimately, there’s just no way to possibly know. All I want is for folks to have more spaces online that aren’t data-selling hellholes like Facebook/Instagram/Threads, Twitter, Tumblr, probably Bluesky eventually (if not already), Reddit, TikTok, etc. There aren’t many well-known medium to large online spaces that are run by the people, for the people anymore. It’s all about “line go up” forever to please shareholders and venture capitalists, not breaking even while running a satisfying service.</p>\n<p>While I think the fediverse proves a different direction that social media could take, being a source of passion projects and the occasional corporate group paying folks to develop key pieces that help everyone else, there is still a place for more centralized social media. The fediverse has its own problems too, both structurally and socially.</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil screaming in fear, hands on his head. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil screaming in fear, hands on his head. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h1 id=\"the-tl-dr-of-my-thoughts-re-cohost-shutting-down\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#the-tl-dr-of-my-thoughts-re-cohost-shutting-down\">The TL;DR of my thoughts re: Cohost shutting down.</a></h1>\n<p>OK this is still a long TL;DR but I tried OK?</p>\n<ul>\n<li>Cohost is shutting down end of the year, going read-only October 1st and getting data backups out the door ASAP. In my opinion, this was going to happen eventually given their funding model - so it was a question of “when”, not “if” it happens.</li>\n<li>Despite the flaws I saw in how Anti-Software Software Club marketed themselves as a company (being leftist co-op not-for-profit despite being an LLC with no obligation to do that), there was still value in what Cohost was trying to do.</li>\n<li>Them incorporating as an LLC, to myself, might have been a mistake since it legally prevented them from bringing on anything resembling volunteer moderators. While being a 501©3 or similar non-profit is difficult, they could still pay the core team and have volunteer mods if needed.</li>\n<li>Their initial round of funding used the Cohost source code as collateral, preventing them from making it open-source to help gather community contributions to bug fixing, feature requests, etc. on the back-end directly.</li>\n<li>They wildly misunderstood Stripe’s terms of service when it comes to payments, forcing them to gut months of work into “eggbux” which is basically what tumblr tipping is, and was part of their effort to become a Patreon alternative (their original goal). They claim this was a sudden change, despite it just being a language clarification for a policy Stripe has had for years now.</li>\n<li>Per the leftist co-op branding, they all agreed to pay themselves equally (for the most part, stuff has changed now and then) and increase their pay to align with cost-of-living adjustments. This, to me, is a noble goal, but contributed to the vast majority of their expenses and made it even harder for their user base to subscribe and help cover operating costs.</li>\n</ul>\n<h3 id=\"despite-all-of-these-negatives-they-still-managed-to\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/rip-cohost/#despite-all-of-these-negatives-they-still-managed-to\">Despite all of these negatives, they still managed to…</a></h3>\n<ul>\n<li>Prove that this is a viable concept - Cohost has INCREDIBLE subscriber rates for people who are willing to pay for the service to keep it alive. This, to me, heavily suggests that people want not-scummy social media that doesn’t sell user data or push shitty ads.</li>\n<li>Prove that users like this kind of service. As far as I’m aware, there was no advertising for Cohost outside of word-of-mouth. Everyone who signed up likely heard of it from someone else. This of course weakened new user rates, but it also meant every active user there heard of it from someone and liked it enough to stay.</li>\n<li>Prove that it might just be possible to do all of this work and pay their core team. That idea alone likely led to more monthly subscribers willing to help keep it afloat, because they knew their money was also helping keep them paid too. I still disagree with their payment model and motives, but hey. They still did it.</li>\n</ul>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/FlexingSenil.png\" alt=\"Senil flexing his biceps, smirking. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil flexing his biceps, smirking. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p><strong>Cohost, despite its flaws, was a fantastic experiment.</strong></p>\n<p>I’m sad that it’s gone, but happy for what it was able to achieve and suggest is possible for future projects. I don’t want people to be disheartened by Cohost’s attempt - I want people to see what they did, try to understand the core pain-points, and try to get farther than ASSC did with Cohost. Maybe we’ll have a true, not-scummy centralized social media competitor someday, because people dare to keep trying to make the dream real.</p>\n<p>Will that ever happen? Time will tell. But I don’t want folks to ever give up. The web can still be ours, one made for the people, by the people, instead of for venture capitalists who want more money forever and ever.</p>\n",
      "date_published": "2024-10-25T00:00:00Z"
    },{
      "id": "https://blog.senil.me/critical-infra-and-e2ee/",
      "url": "https://blog.senil.me/critical-infra-and-e2ee/",
      "title": "Why I view E2EE the same as critical infrastructure.",
      "content_html": "<p>This is just a compilation of a very long thread I made on Mastodon so I can share this better. For more context, this is all in reference to my replies to Soatok’s ongoing responses to the Matrix dev team re: Soatok’s responsible disclosure of security flaws. The TL;DR is Matrix was using an educational implementation of a thing, that explicitly said to not use it in production, and didn’t do anything about that for seven years until Soatok found it.</p>\n<p><a href=\"https://furry.engineer/@senil888/112964632462775370\">Here’s a link to my first of the reply chain directly talking about that.</a></p>\n<h2 id=\"i-kind-of-worked-in-the-power-industry\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#i-kind-of-worked-in-the-power-industry\">I (kind of) worked in the power industry.</a></h2>\n<p>The main project I had with my (now former) company in my short time there was for a hydro dam up in the Idaho panhandle, in Boundary County - not joking, it’s called that. That’s not too important, though.</p>\n<p>What is important is that this fairly small hydro dam, which can output about 4 megawatts during peak spring runoff, helps power the nearby towns via a city-run utility. While it’s not the end of the world for the dam to be offline, them being offline means the utility has to buy even more power than if it was running. Which costs the city a fair bit more money than running the dam themselves, because you have the power generation places that need their money to run their facilities, the transmission companies that need to fund their projects, and on and on and on.</p>\n<p>So, it’s pretty important to help them get back on their feet. And we had a big task - we were to replace their old Allen-Bradley PLCs with our own, and toss in a SCADA system too.</p>\n<p>The SCADA system is fairly straightforward when it comes to data inputs - I could just take the data, label it, maybe do some conversions as-needed, and toss it up the chain. For this system, it went from generator-connected programmable logic controller (PLC) to a beefier controller running more sophisticated software, as well as a basic HMI, up to a control house computer that ran a COPA-DATA Zenon HMI that we also designed and developed. <strong>We were responsible for a lot of stuff.</strong></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ScaredSenil.png\" alt=\"Senil with his hands on his head, mouth wide open in fear. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil with his hands on his head, mouth wide open in fear. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<h2 id=\"the-controls\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#the-controls\">The Controls</a></h2>\n<p>The hard part comes in when we actually add in the controls. Which is, y’know, important since we’re replacing everything their old PLCs did with our own system and solution. Which meant we needed reference code, since the customer knows their system the best (mostly, we talked with the operators who knew how to run the thing, but didn’t 100% know the backbones). What we got? Was in ladder logic. Which looks very different to structured text, which is probably what you think of when I say “what does a programming language look like typed out?” So… not only did we need to re-create that, we had to “translate” it into ST as well. Fun!</p>\n<p>This is where the controls joy comes in. Each PLC acts mostly the same when it comes to general operations. These outputs are for lights, this output needs to do this thing and get this signal for some time back before another thing can even think about asserting, etc.</p>\n<p>Spinning up a hydro generator takes a decent bit of time. Not forever mind you, but there’s a lot of steps involved. First you need to get water to, well, the generator’s turbine inlet. But you can’t just send water straight from the turbine inlet valve (TIV) to the turbines. You need to balance the water pressures between everything because if you don’t? Congratulations, you just broke the turbine and this generator has to be rebuilt.</p>\n<p>Once the TIV bypass does its thing for a while, we can actually open the TIV and start to send water to the turbine. Once water is getting to the turbine, we open up the wicket gates - which actually finally let water to the turbines. They’re controllable, so we can define exactly how much water gets to flow, and thus how much power a generator actually outputs.</p>\n<p>Then it’s the usual generator stuff. Get the thing up to speed and, once it’s up to speed and stays there for a little while, ya gotta sync the generator phases and frequency to the grid phases and frequency. If the phase angles are off too much, you end up kicking the generator forwards or backwards when the breaker closes to the grid. That can be violent, and harm the generator over time - or outright break it if the phase angle is off by too much. So we need that to be as precise as possible, and to close as soon as we’re confident it’ll safely kick in without breaking anything. So that’s the gist of the start-up sequence at the dam. All is well and good there.</p>\n<h2 id=\"edge-cases-cannot-exist\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#edge-cases-cannot-exist\">“Edge cases cannot exist.”</a></h2>\n<p>However. There’s a fail over system with the Zenon HMI. See, the two powerhouse controllers gather all available data in this system as a form of redundancy - not via the physical network, but via the hardware. This is fine when it comes to inputs, since that version of Zenon can only listen to one controller at a time, but we run into problems with outputs. The “Zenon only talks to one controller at a time” becomes the enemy, in a way.</p>\n<p>While realistically rare, or outright “would never happen”, it is still technically possible for an operator to send a binary output command or update an analog setting <em>while Zenon changes which controller it listens to</em>. This can be for a variety of reasons - the operator told the controllers to switch over, Zenon lost access to one controller so it’s starting to talk to the other (a process that takes a bit of time), etc. <strong>The absolute last thing we need is for a command to be sent twice during this switchover,</strong> because output data cannot be shared between the two because of the whole “Zenon can only talke to one controller at a time.”</p>\n<p>Our first main problem was fixing this control switchover problem, brought upon the very nature of our design scheme and how Zenon works (which I think they’ve fixed since that version, but I never worked on Zenon myself). Again, we have to account for every possible problem which means figuring out how to make sure a command sent from Zenon “syncs” between devices. The solution I came up with was pretty clunky, to be frank, but it worked - I literally just told the controller that knew it was talking to Zenon to periodically pulse the analog setpoint to the other controller, so it at least knew what was going on and could report back to Zenon appropriately.</p>\n<p>What ended up happening was one generator - which was being rebuilt - wouldn’t report how far the wicket gates were open. I shouldn’t need to say that “this is bad” because if we can’t tell how far the wickets are open, <strong>we have no idea how much water, if any, is getting to the turbine proper.</strong></p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/ConfusedSenil.png\" alt=\"Senil dazed and drooling, with a loading icon above him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil dazed and drooling, with a loading icon above him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p>The sensor was a hall effect one, made of steel. There is a window above it. This is a dam, close to the river and a waterfall. I hope you can guess what the problem is. Hint, it involves steel not liking moisture. We cleaned out a COPIOUS amount of rust, and hey look the sensor was finally working again, we got wicket gate data. So we could finally spin up this generator. Which we were able to do…</p>\n<p>Except, y’know. Problem time. The generator was vibrating, and vibrating a LOT. Consistently. Every time it started up, some code I adapted from the original ladder logic would run and trigger an emergency stop. The code runs on the controller directly talking to the generator, quietly monitoring vibration data. If ANY of the four input sensors report values over some threshold for more than a few seconds? Emergency stop time.</p>\n<p>So something is still wrong with this generator. We trust the sensors since we’re getting good data as the generator spins up, it just… shakes too much. We actually temporarily disabled the logic that trips the generator to monitor its behavior if it didn’t e-stop in time. It kept vibrating, more and more. It would probably shake itself apart if you let it keep going. It also did it consistently, and it was one bearing’s sensor that was consistently tripping. <em>(aside: that bearing had also seized up TWICE during prior trips to commission this generator. It also did it again after we left the site. That bearing did not like existing, apparently.)</em></p>\n<p>The only reason we were able to check this case is because what I had written worked and we knew it worked. In part because that same logic was on three other generators, but we were able to accidentally prove that hey, if this happens, it’ll trigger an emergency stop no problem. It turned out the people rebuilding the generator didn’t balance the flywheel when they fixed the bearing before, so oops! You can’t spin that thing up just yet.</p>\n<h2 id=\"remember-lives-are-at-stake\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#remember-lives-are-at-stake\">Remember: Lives are at stake.</a></h2>\n<p>Imagine how bad this whole thing could’ve been if we weren’t as rigorous as we were. Generators could’ve broken apart. People could’ve been hurt. Expensive equipment could’ve gotten seriously damaged. Hell, it might not even have started up because of how much other equipment we had to interface with that we couldn’t investigate ourselves. That client trusted us to get their dam up and running with new hardware that would treat them well for many years to come, and to build a partnership with a firm they could trust. In the end, we delivered and they’re supposedly working on more (smaller) projects with them.</p>\n<p>I don’t know the specifics, but BECAUSE we were persistent in making sure every edge case we could think of was resolved, and fixing everything in real-time as problems came up (and making sure our fixes wouldn’t introduce NEW problems) we were able to tell them “you can trust us.” Because ultimately, <strong>“no one is obligated to buy from you. You can go out of business tomorrow if everyone decides to never work with you.”</strong></p>\n<p><em>(aside again: this is something I try to tell anyone who is running any kind of small business. Nobody is obliged to commission you, to hire you, to whatever. It’s on you to stay on top of things and make people want to work with you, and keep working with you.)</em></p>\n<h2 id=\"this-is-still-about-matrix-trust-me\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"https://blog.senil.me/critical-infra-and-e2ee/#this-is-still-about-matrix-trust-me\">This is still about Matrix, trust me.</a></h2>\n<p>It’s largely because of my experience with the hydro project that I just can’t trust companies, projects, and teams that hide vulnerabilities and failure points and hope nobody finds them. It makes me question how many they actually have hidden when someone does find one. How many defects does their thing have, if some of the most obvious ones are let through? If this obvious error got through their QA checks, what else is lying under the hood that we don’t know about yet?</p>\n<figure><a href=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\"><img src=\"https://blog.senil.me/assets/images/stickers/AngrySenil.png\" alt=\"Senil cracking his knuckles with flames behind him. Art by [Dragonjourney](https://www.furaffinity.net/user/dragonjourney)\" loading=\"lazy\" style=\"\" /></a><figcaption>Senil cracking his knuckles with flames behind him. Art by <a href=\"https://www.furaffinity.net/user/dragonjourney\">Dragonjourney</a></figcaption></figure>\n<p><strong>Can I trust this system to be robust enough in the event of a catastrophic failure?</strong></p>\n<p>I know cryptography - E2EE in particular - isn’t remotely comparable to what I’ve worked on, but what I’ve worked on is super important. Lives are at stake with these projects. I need to be confident that what I do isn’t going to hurt people. That it isn’t going to break equipment. That it isn’t going to fail in two years because of an oversight, <em>or something we knew about and ignored because it’s “technically impossible”.</em></p>\n<p>I need projects in critical fields that take themselves seriously to ACT like lives are at stake, because maybe some are.</p>\n<p>But if you’re taking yourself seriously, in something as important as cryptography, something that is increasingly important every single day in every field - critical infrastructure included - you need to act like lives are at stake if you fuck up.</p>\n<p>I know some of this shit is just a chat protocol, “why are you so pressed” blah blah blah. A lot of people herald E2EE services as a secure way to also talk about protests and labor organization without significant risk of getting caught. Of course, if you don’t regularly use E2EE normally the fact you use it might implicate you. When it comes to organizing? If a court requests data from some service, as little data as possible should be sent out. Because people get jailed or imprisoned for organizing. Those lives are on the line if your system isn’t up to snuff.</p>\n<p>This isn’t to say “just pick any E2EE service, it’s fine” because it’s not fine to do that. People need a service they can trust, that’s reliable, that takes security seriously and does everything in their power to make sure what they do is as secure as possible. From what they know is a fail point, and what they later find out is a new possible fail point. People need services they can trust that has their best interests in mind. Clients need businesses they can trust that can hold up their end of the contract and deliver a quality solution that fits their client’s needs.</p>\n<p><strong>Why should anything like this be any different?</strong></p>\n<p>People die when we fuck up in the power industry. We can’t allow that to happen, ever. Our trust is built upon proving a track record of quality work that is done timely. Work that stands the test of time as systems operate. I know a lot of shit is nothing compared to critical infrastructure, but I wish more folks took it remotely as seriously as people in my industry have to. Because if we fuck up, people get hurt. People lose power. Facilities get damaged. Industry stops. And, ultimately…</p>\n<p><em><strong>If the power goes out… so does everything else.</strong></em></p>\n",
      "date_published": "2024-10-21T00:00:00Z"
    }
  ]
}
